Repository: quarkusio/es.quarkus.io
Catalog: l10n/po/*/_versions/main/guides/continuous-testing.adoc.po
Languages: es_es

source: Continuous Testing
es_es: Pruebas continuas

source: Learn how to use continuous testing in your Quarkus Application.
es_es: Aprenda a utilizar las pruebas continuas en su aplicación Quarkus.

source: Prerequisites
es_es: Requisitos previos

source: The completed greeter application from the xref:getting-started.adoc[Getting Started Guide]
es_es: La aplicación de bienvenida completada de la xref:getting-started.html[Guía de Inicio]

source: Introduction
es_es: Introducción

source: Quarkus supports continuous testing, where tests run immediately after code changes have been saved. This allows you to get instant feedback on your code changes. Quarkus detects which tests cover which code, and uses this information to only run the relevant tests when code is changed.
es_es: Quarkus admite pruebas continuas, donde las pruebas se ejecutan inmediatamente después de guardar los cambios en el código. Esto le permite obtener retroalimentación instantánea sobre sus cambios en el código. Quarkus detecta qué pruebas cubren qué código, y utiliza esta información para ejecutar sólo las pruebas necesarias cuando se cambia el código.

source: Solution
es_es: Solución

source: Start the xref:getting-started.adoc[Getting Started] application (or any other application) using:
es_es: Inicie la aplicación xref:getting-started.html["Getting Started] " (o cualquier otra aplicación) utilizando:

source: Quarkus will start in development mode as normal, but down the bottom of the screen you should see the following:
es_es: Quarkus se iniciará en modo de desarrollo como es normal, pero en la parte inferior de la pantalla debería ver lo siguiente:

source: Press `r` and the tests will start running. You should see the status change down the bottom of the screen as they are running, and it should finish with:
es_es: Pulse `r` y las pruebas comenzarán a ejecutarse. Usted debe ver el cambio de estado en la parte inferior de la pantalla, ya que se están ejecutando, y debe terminar con:

source: If you want continuous testing to start automatically you can set `quarkus.test.continuous-testing=enabled` in `application.properties`. If you don't want it at all you can change this to `disabled`.
es_es: Si desea que las pruebas continuas se inicien automáticamente, puede configurar `quarkus.test.continuous-testing=enabled` en `application.properties`. Si no desea que se inicien en absoluto, puede cambiar este valor a `disabled`.

source: Now you can start making changes to your application. Go into the `GreetingResource` and change the hello endpoint to return `"hello world"`, and save the file. Quarkus should immediately re-run the test, and you should get output similar to the following:
es_es: Ahora puede empezar a hacer cambios en su aplicación. Entre en `GreetingResource` y cambie el método `hello` para que devuelva `"hello world"`, y guarde el archivo. Quarkus debería volver a ejecutar inmediatamente la prueba, y usted debería obtener una salida similar a la siguiente:

source: Change it back and the tests will run again.
es_es: Vuelva a cambiarlo y las pruebas se ejecutarán de nuevo.

source: Controlling Continuous Testing
es_es: Control de las pruebas continuas

source: There are various hotkeys you can use to control continuous testing. Pressing `h` will display the following list of commands:
es_es: Existen varias teclas de acceso rápido que puede utilizar para controlar las pruebas continuas. Si pulsa `h` aparecerá la siguiente lista de comandos:

source: These are explained below:
es_es: Se explican a continuación:

source: [r] - Re-run all tests
es_es: [r] - Volver a ejecutar todas las pruebas

source: This will re-run every test
es_es: Esto volverá a ejecutar todas las pruebas

source: [f] - Re-run failed tests
es_es: [f] - Volver a ejecutar las pruebas fallidas

source: This will re-run every failing test
es_es: Esto volverá a ejecutar cada prueba que falle

source: [b] - Toggle 'broken only' mode, where only failing tests are run
es_es: [b] - Activar el modo "sólo fallidas", en el que sólo se ejecutan las pruebas que fallan

source: Broken only mode will only run tests that have previously failed, even if other tests would normally be affected by a code change. This can be useful if you are modifying code that is used by lots of tests, but you only want to focus on debugging the failing one.
es_es: El modo de sólo fallidas únicamente ejecutará las pruebas que hayan fallado previamente, incluso si otras pruebas se ven afectadas por un cambio en el código. Esto puede ser útil si está modificando código que es utilizado por muchas pruebas, pero sólo quiere centrarse en depurar la que ha fallado.

source: [v] - Print failures from the last test run
es_es: [v] - Imprime los fallos de la última prueba realizada

source: Prints the failures to the console again, this can be useful if there has been lots of console output since the last run.
es_es: Imprime los fallos en la consola de nuevo, esto puede ser útil si ha habido mucha salida en la consola desde la última ejecución.

source: [p] - Pause tests
es_es: [p] - Pausa de las pruebas

source: Temporarily stops running tests. This can be useful if you are making lots of changes, and don't want feedback until they are all done.
es_es: Detiene temporalmente la ejecución de las pruebas. Esto puede ser útil si usted está haciendo muchos cambios, y no quiere retroalimentación hasta que estén todos hechos.

source: [o] - Toggle test output
es_es: [o] - Conmutar la salida de la prueba

source: By default test output is filtered and not displayed on the console, so that test output and dev mode output is not interleaved. Enabling test output will print output to the console when tests are run. Even when output is disabled the filtered output is saved and can be viewed in the Dev UI.
es_es: Por defecto, la salida de prueba se filtra y no se muestra en la consola, de modo que la salida de prueba y la salida del modo desarrollo no se intercalan. Al habilitar la salida de prueba se imprimirá la salida en la consola cuando se ejecuten las pruebas. Incluso cuando la salida está desactivada, la salida filtrada se guarda y se puede ver en la Dev UI.

source: [i] - Toggle instrumentation based reload
es_es: [i] - Activar la recarga basada en la instrumentación

source: This is not directly related to testing, but allows you to toggle instrumentation based reload. This will allow live reload to avoid a restart if a change does not affect the structure of a class, which gives a faster reload and allows you to keep state.
es_es: Esto no está directamente relacionado con las pruebas, pero le permite activar la recarga basada en la instrumentación. Esto permitirá la recarga en vivo para evitar un reinicio si un cambio no afecta a la estructura de una clase, lo que proporciona una recarga más rápida y le permite mantener el estado.

source: [l] - Toggle live reload
es_es: [l] - Activar la recarga en vivo

source: This is not directly related to testing, but allows you to turn live reload on and off.
es_es: Esto no está directamente relacionado con las pruebas, pero le permite activar y desactivar la recarga en vivo.

source: [s] - Force restart
es_es: [s] - Forzar el reinicio

source: This will force a scan for changed files, and will perform a live reload with and changes. Note that even if there are no changes the application will still restart. This will still work even if live reload is disabled.
es_es: Esto forzará un escaneo de archivos modificados y realizará una recarga en vivo con los cambios. Tenga en cuenta que incluso si no hay cambios la aplicación se reiniciará. Esto seguirá funcionando incluso si la recarga en vivo está desactivada.

source: Continuous Testing Without Dev Mode
es_es: Pruebas continuas sin modo de desarrollo

source: The Dev UI is not available when running in continuous testing mode, as this is provided by dev mode.
es_es: La interfaz de usuario de desarrollo no está disponible cuando se ejecuta en el modo de pruebas continuas, ya que esto es proporcionado por el modo de desarrollo.

source: Multi-module Projects
es_es: Proyectos multimodulares

source: Note that continuous testing supports multi-module projects, so tests in modules other than the application can still be run when files are changed. The modules that are run can be controlled using config as listed below.
es_es: Tenga en cuenta que las pruebas continuas admiten proyectos multimódulo, por lo que las pruebas en módulos distintos de la aplicación pueden seguir ejecutándose cuando se modifiquen los archivos. Los módulos que se ejecutan pueden controlarse mediante la configuración, como se indica a continuación.

source: This is enabled by default, and can be disabled via `quarkus.test.only-test-application-module=true`.
es_es: Está activada por defecto, y puede desactivarse a través de `quarkus.test.only-test-application-module=true`.

source: Configuring Continuous Testing
es_es: Configuración de las pruebas continuas

source: Continuous testing supports multiple configuration options that can be used to limit the tests that are run, and to control the output. The configuration properties are shown below:
es_es: Las pruebas continuas admiten múltiples opciones de configuración que pueden utilizarse para limitar las pruebas que se ejecutan y controlar la salida. Las propiedades de configuración se muestran a continuación:

source: <span class="icon"><i class="fa fa-lock" title="Fixed at build time"></i></span> Configuration property fixed at build time - All other configuration properties are overridable at runtime <input type="search" id="config-search-0" placeholder="FILTER CONFIGURATION" disabled>
es_es: <span class="icon"><i class="fa fa-lock" title="Fijado en tiempo de compilación"></i></span> Propiedad de configuración fijada en tiempo de compilación - Todas las demás propiedades de configuración son anulables en tiempo de ejecución <input type="search" id="config-search-0" placeholder="CONFIGURACIÓN DEL FILTRO" disabled>
