Repository: quarkusio/es.quarkus.io
Catalog: l10n/po/*/_versions/main/guides/quarkus-reactive-architecture.adoc.po
Languages: es_es

source: Fault Tolerance: provide retry, fallback, circuit breakers abilities to your application.It can be used with Mutiny types.
es_es: Tolerancia a fallos: proporciona capacidades de reintento, fallback y circuit breakers a su aplicación. Puede utilizarse con tipos de Mutiny.

source: Engine
es_es: Motor

source: Vert.x : the underlying reactive engine of Quarkus. The extension allows accessing to the managed Vert.x instance, as well as its Mutiny variant (exposing the Vert.x API using Mutiny types)
es_es: Vert.x : el motor reactivo subyacente de Quarkus. La extensión permite acceder a la instancia administrada de Vert.x, así como a su variante Mutiny (que expone la API de Vert.x utilizando tipos de Mutiny)

source: Context Propagation: capture and propagate contextual objects (transaction, principal…) in a reactive pipeline
es_es: Propagación de contexto: captura y propaga objetos contextuales (transacción, principal, etc.) dentro de una tubería reactiva
