Repository: quarkusio/es.quarkus.io
Catalog: l10n/po/*/_versions/main/guides/quarkus-reactive-architecture.adoc.po
Languages: es_es

source: Quarkus Reactive Architecture
es_es: Arquitectura Reactiva Quarkus

source: Quarkus is reactive. It's even more than this: Quarkus unifies reactive and imperative programming. You don't even have to choose: you can implement reactive components and imperative components then combine them inside the very **same** application. No need to use different stacks, tooling or APIs; Quarkus bridges both worlds.
es_es: Quarkus es reactivo. Es incluso más que esto: Quarkus unifica la programación reactiva y la imperativa. Ni siquiera tiene que elegir: puede implementar componentes reactivos y componentes imperativos y luego combinarlos dentro de la **misma** aplicación. No es necesario usar diferentes stacks, herramientas o APIs; Quarkus conecta ambos mundos.

source: This page will explain what we mean by _Reactive_ and how Quarkus enables it. We will also discuss execution and programming models. Finally, we will list the Quarkus extensions offering reactive facets.
es_es: Esta página explicará lo que entendemos por _Reactivo_ y cómo Quarkus lo habilita. También se abordarán los modelos de ejecución y programación. Por último, se enumerarán las extensiones de Quarkus que ofrecen capacidades reactivas.

source: What is _Reactive_?
es_es: ¿Qué es _Reactivo_?

source: The _Reactive_ word is overloaded and associated with many concepts such as back-pressure, monads, or event-driven architecture. So, let's clarify what we mean by _Reactive_.
es_es: La palabra _Reactivo_ está sobrecargada y asociada a muchos conceptos como la contrapresión, las mónadas o la arquitectura basada en eventos. Por lo tanto, aclaremos qué entendemos por _Reactivo_.

source: _Reactive_ is a set of principles and guidelines to build responsive distributed systems and applications. The https://www.reactivemanifesto.org/[Reactive Manifesto] characterizes _Reactive Systems_ as distributed systems having four characteristics:
es_es: La _Reactividad_ es un conjunto de principios y directrices para construir sistemas y aplicaciones distribuidos con capacidad de respuesta. El https://www.reactivemanifesto.org/[Manifiesto Reactivo] caracteriza los _Sistemas Reactivos_ como sistemas distribuidos que tienen cuatro características:

source: Responsive - they must respond in a timely fashion
es_es: Capacidad de respuesta: deben responder de manera oportuna

source: Elastic - they adapt themselves to the fluctuating load
es_es: Elásticos: se adaptan a las fluctuaciones de la carga

source: Resilient - they handle failures gracefully
es_es: Resilientes: gestionan los fallos de manera controlada

source: In addition to this, the https://principles.reactive.foundation/[Reactive Principles white paper] lists a set of rules and patterns to help the construction of reactive systems.
es_es: Además de esto, el https://principles.reactive.foundation/[artículo de Principios Reactivos] enumera un conjunto de reglas y patrones para facilitar la construcción de sistemas reactivos.

source: Reactive Systems and Quarkus
es_es: Sistemas Reactivos y Quarkus

source: Reactive System is an architectural style that can be summarized by: distributed systems done right. Relying on asynchronous message passing helps enforce the loose coupling (both in terms of space and time) between the different components. You send messages to virtual destinations. The receiver can be located anywhere, or even not yet exist at the time of the message dispatch. The elasticity pillar allows scaling up and down individual components according to the load. Elasticity also provides redundancy, which helps with the resilience pillar. Failures are inevitable. Components forming a reactive system must handle them gracefully, avoid cascading failures, and self-adapt themselves.
es_es: El sistema Reactivo es un estilo arquitectónico que puede resumirse como: sistemas distribuidos bien hechos. El uso de paso de mensajes asíncronos ayuda a reforzar el acoplamiento débil (tanto en términos de espacio como de tiempo) entre los distintos componentes. Se envían mensajes a destinos virtuales. El receptor puede estar situado en cualquier lugar, o incluso no existir aún en el momento del envío del mensaje. El pilar de elasticidad permite escalar hacia arriba o hacia abajo los componentes individuales según la carga. La elasticidad también proporciona redundancia, lo que contribuye al pilar de resiliencia. Los fallos son inevitables. Los componentes que forman un sistema reactivo deben manejarlos de manera elegante, evitar fallos en cascada y adaptarse automáticamente.

source: A responsive system can continue to handle the request while facing failures and under fluctuating load. Quarkus has been tailored for that. It provides features that will help you design, implement and operate reactive systems.
es_es: Un sistema con capacidad de respuesta puede seguir gestionando la solicitud mientras se enfrenta a fallos y bajo una carga fluctuante. Quarkus ha sido diseñado específicamente para ello. Proporciona características que le ayudarán a diseñar, implementar y operar sistemas reactivos.

source: Reactive Applications
es_es: Aplicaciones Reactivas

source: Quarkus is not only going to help you build reactive systems. It's also going to make sure that each constituent enforces the reactive principles and is highly efficient.
es_es: Quarkus no sólo le va a ayudar a construir sistemas reactivos. También garantizará que cada componente cumpla con los principios reactivos y sea altamente eficiente.

source: Efficiency is essential, especially in the Cloud and in containerized environments. Resources, such as CPU and memory, are shared among multiple applications. Greedy applications that consume lots of memory are inefficient and put penalties on sibling applications. You may need to request more memory, CPU, or bigger virtual machines. It either increases your monthly Cloud bill or decreases your deployment density.
es_es: La eficiencia es esencial, especialmente en entornos de nube y contenedores. Los recursos, como la CPU y la memoria, se comparten entre varias aplicaciones. Las aplicaciones que consumen grandes cantidades de memoria son ineficientes y penalizan a las aplicaciones coexistentes. Puede ser necesario solicitar más memoria, CPU o máquinas virtuales de mayor capacidad. Esto incrementa el costo mensual en la nube o reduce la densidad de despliegue.

source: I/O is an essential part of almost any modern system. Whether it is to call a remote service, interact with a database, or send messages to a broker, there are all I/O-based operations. Efficiently handling them is critical to avoid greedy applications. For this reason, Quarkus uses non-blocking I/O, which allows a low number of OS threads to manage many concurrent I/Os. As a result, Quarkus applications allow for higher concurrency, use less memory, and improve the deployment density.
es_es: La E/S es una parte esencial de prácticamente cualquier sistema moderno. Ya sea para invocar un servicio remoto, interactuar con una base de datos o enviar mensajes a un intermediario, todas son operaciones basadas en E/S. Gestionarlas de manera eficiente es fundamental para evitar aplicaciones que consuman recursos de forma excesiva. Por esta razón, Quarkus utiliza E/S no bloqueante, lo que permite que un número reducido de hilos del sistema operativo gestione múltiples operaciones de E/S concurrentes. Como resultado, las aplicaciones basadas en Quarkus permiten una mayor concurrencia, consumen menos memoria y mejoran la densidad de despliegue.

source: How does Quarkus enable Reactive?
es_es: ¿Cómo Quarkus habilita la Reactividad?

source: Under the hood, Quarkus has a reactive engine. This engine, powered by Eclipse Vert.x and Netty, handles the non-blocking I/O interactions.
es_es: Bajo el capó, Quarkus cuenta con un motor reactivo. Este motor, impulsado por Eclipse Vert.x y Netty, gestiona las interacciones de E/S no bloqueantes.

source: Quarkus extensions and the application code can use this engine to orchestrate I/O interactions, interact with databases, send and receive messages, and so on.
es_es: Las extensiones de Quarkus y el código de la aplicación pueden utilizar este motor para orquestar interacciones de E/S, interactuar con bases de datos, enviar y recibir mensajes, entre otras operaciones.

source: Reactive execution model
es_es: Modelo de ejecución reactiva

source: While using non-blocking I/O has tremendous benefits, it does not come for free. Indeed, it introduces a new execution model quite different from the one used by classical frameworks.
es_es: Si bien el uso de E/S no bloqueante ofrece beneficios significativos, no está exento de costos. De hecho, introduce un nuevo modelo de ejecución, bastante diferente del empleado por los frameworks tradicionales.

source: Traditional applications use blocking I/O and an imperative (sequential) execution model. So, in an application exposing an HTTP endpoint, each HTTP request is associated with a thread. In general, that thread is going to process the whole request and the thread is tied up serving only that request for the duration of that request. When the processing requires interacting with a remote service, it uses blocking I/O. The thread is blocked, waiting for the result of the I/O. While that model is simple to develop with (as everything is sequential), it has a few drawbacks. To handle concurrent requests, you need multiple threads, so, you need to introduce a worker thread pool. The size of this pool constrains the concurrency of the application. In addition, each thread has a cost in terms of memory and CPU. Large thread pools result in greedy applications.
es_es: Las aplicaciones tradicionales utilizan E/S bloqueante y un modelo de ejecución imperativo (secuencial). Así, en una aplicación que expone un endpoint HTTP, cada solicitud HTTP se asocia con un hilo. En general, dicho hilo procesa toda la solicitud y permanece dedicado exclusivamente a esa solicitud durante su ejecución. Cuando el procesamiento requiere interactuar con un servicio remoto, se utiliza E/S bloqueante. El hilo queda bloqueado mientras espera el resultado de la operación de E/S. Aunque este modelo es sencillo de desarrollar (ya que todo ocurre de forma secuencial), presenta varias desventajas. Para manejar solicitudes concurrentes, se requieren múltiples hilos, lo que implica la necesidad de un grupo de hilos de trabajo (worker thread pool). El tamaño de este grupo limita la concurrencia de la aplicación. Además, cada hilo tiene un costo en términos de memoria y CPU. Los grupos de hilos grandes dan lugar a aplicaciones con alto consumo de recursos.

source: As we have seen above, non-blocking I/O avoids that problem. A few threads can handle many concurrent I/O. If we go back to the HTTP endpoint example, the request processing is executed on one of these I/O threads. Because there are only a few of them, you need to use them wisely. When the request processing needs to call a remote service, you can't block the thread anymore. You schedule the I/O and pass a continuation, i.e., the code to execute once the I/O completes.
es_es: Como vimos anteriormente, la E/S no bloqueante evita este problema. Un número reducido de hilos puede manejar múltiples operaciones de E/S concurrentes. Volviendo al ejemplo del endpoint HTTP, el procesamiento de la solicitud se ejecuta en uno de estos hilos de E/S. Dado que son pocos, deben utilizarse de manera eficiente. Cuando el procesamiento de la solicitud requiere invocar un servicio remoto, ya no es posible bloquear el hilo. En su lugar, se programa la operación de E/S y se pasa una continuación, es decir, el código que se ejecutará una vez que la operación de E/S haya finalizado.

source: This model is much more efficient, but we need a way to write code to express these continuations.
es_es: Este modelo es mucho más eficiente, pero se requiere una forma de escribir código que exprese estas continuaciones.

source: Reactive Programming Models
es_es: Modelos de Programación Reactiva

source: The Quarkus architecture, based on non-blocking I/O and message passing, allows multiple supporting reactive development models that are all different in how they express continuations. The two main ways to write reactive code with Quarkus are:
es_es: La arquitectura de Quarkus, basada en E/S no bloqueante y paso de mensajes, permite múltiples modelos de desarrollo reactivo compatibles, todos ellos diferenciados en la forma de expresar continuaciones. Las dos principales formas de escribir código reactivo con Quarkus son:

source: Reactive Programming with https://smallrye.io/smallrye-mutiny[Mutiny], and
es_es: Programación Reactiva con https://smallrye.io/smallrye-mutiny[Mutiny], y

source: Coroutines with Kotlin
es_es: Corutinas con Kotlin

source: First, https://smallrye.io/smallrye-mutiny[Mutiny] is an intuitive, event-driven reactive programming library. With Mutiny, you write event-driven code. Your code is a pipeline receiving events and processing them. Each stage in your pipeline can be seen as a continuation, as Mutiny invokes them when the upstream part of the pipeline emits an event.
es_es: En primer lugar, https://smallrye.io/smallrye-mutiny[Mutiny] es una biblioteca de programación reactiva intuitiva y dirigida por eventos. Con Mutiny, se escribe código orientado a eventos. Su código es una tubería que recibe eventos y los procesa. Cada etapa de la tubería puede considerarse como una continuación, ya que Mutiny las invoca cuando la parte anterior de la tubería emite un evento.

source: The Mutiny API has been tailored to improve the readability and maintenance of the codebase. Mutiny provides everything you need to orchestrate asynchronous actions, including concurrent execution. It also offers a large set of operators to manipulate individual events and streams of events.
es_es: La API de Mutiny ha sido adaptada para mejorar la legibilidad y el mantenimiento del código. Mutiny proporciona todo lo necesario para orquestar acciones asíncronas, incluida la ejecución concurrente. Además, ofrece un amplio conjunto de operadores para manipular eventos individuales y flujos de eventos.

source: Find more info about Mutiny and its usage in Quarkus on xref:mutiny-primer.adoc[Mutiny support documentation].
es_es: Encuentre más información sobre Mutiny y su uso en Quarkus en la xref:mutiny-primer.adoc[documentación de soporte de Mutiny].

source: Co-routines are a way to write asynchronous code sequentially. It suspends the execution of the code during I/O and registers the rest of the code as the continuation. Kotlin coroutines are great when developing in Kotlin and only need to express sequential compositions (chain of co-dependent asynchronous tasks).
es_es: Las corutinas son una forma de escribir código asíncrono de manera secuencial. Suspenden la ejecución del código durante las operaciones de E/S y registran el resto del código como continuación. Las corutinas de Kotlin son ideales al desarrollar en Kotlin cuando sólo se necesita expresar composiciones secuenciales (cadena de tareas asíncronas interdependientes).

source: Unification of Imperative and Reactive
es_es: Unificación del enfoque Imperativo y Reactivo

source: Changing your development model is not simple. It requires relearning and restructuring code in a non-blocking fashion. Fortunately, you don't have to do it!
es_es: Cambiar su modelo de desarrollo no es sencillo. Requiere reaprender y reestructurar el código para que sea no bloqueante. Afortunadamente, ¡no es necesario hacerlo!

source: Quarkus is inherently reactive thanks to its reactive engine. But, you, as an application developer, don't have to write reactive code. Quarkus unifies reactive and imperative. It means that you can write traditional blocking applications on Quarkus. But how do you avoid blocking the I/O threads? Quarkus implements a https://en.wikipedia.org/wiki/Proactor_pattern[proactor pattern] that switches to worker thread when needed.
es_es: Quarkus es inherentemente reactivo gracias a su motor reactivo. Sin embargo, usted, como desarrollador de aplicaciones, no necesita escribir código reactivo. Quarkus unifica los enfoques reactivo e imperativo. Esto significa que puede desarrollar aplicaciones tradicionales de bloqueo en Quarkus. ¿Pero cómo se evita bloquear los hilos de E/S? Quarkus implementa un https://en.wikipedia.org/wiki/Proactor_pattern[patrón proactor] que cambia a un hilo de trabajo cuando es necesario.

source: Thanks to hints in your code (such as the `@Blocking` and `@NonBlocking` annotations), Quarkus extensions can decide when the application logic is blocking or non-blocking. If we go back to the HTTP endpoint example from above, the HTTP request is always received on an I/O thread. Then, the extension dispatching that request to your code decides whether to call it on the I/O thread, avoiding thread switches, or on a worker thread. This decision depends on the extension. For example, the Quarkus REST (formerly RESTEasy Reactive) extension uses the `@Blocking` annotation to determine if the method needs to be invoked using a worker thread, or if it can be invoked using the I/O thread.
es_es: Gracias a las indicaciones en su código (como las anotaciones `@Blocking` y `@NonBlocking`), las extensiones de Quarkus pueden determinar cuándo la lógica de la aplicación es bloqueante o no bloqueante. Si volvemos al ejemplo del endpoint HTTP mencionado anteriormente, la solicitud HTTP siempre se recibe en un hilo de E/S. Luego, la extensión que despacha esa solicitud a su código decide si invocarla en el hilo de E/S, evitando cambios de hilo, o en un hilo de trabajo. Esta decisión depende de la extensión. Por ejemplo, la extensión Quarkus REST (anteriormente RESTEasy Reactive) utiliza la anotación `@Blocking` para determinar si el método debe ejecutarse en un hilo de trabajo o si puede ejecutarse directamente en el hilo de E/S.

source: Quarkus is pragmatic and versatile. You decide how to develop and execute your application. You can use the imperative way, the reactive way, or mix them, using reactive on the parts of the application under high concurrency.
es_es: Quarkus es pragmático y versátil. Usted decide cómo desarrollar y ejecutar su aplicación. Puede utilizar el enfoque imperativo, el reactivo o una combinación de ambos, aplicando la programación reactiva en las partes de la aplicación que requieren alta concurrencia.

source: Quarkus Extensions enabling Reactive
es_es: Las extensiones de Quarkus que habilitan la Reactividad

source: Quarkus offers a large set of reactive APIs and features. This section lists the most important, but it's not an exhaustive list. Quarkus adds new features in every release, and the https://github.com/quarkiverse[Quarkiverse] proposes many extensions enabling _Reactive_.
es_es: Quarkus ofrece un amplio conjunto de API y características reactivas. Esta sección enumera las más importantes, pero no constituye una lista exhaustiva. Quarkus agrega nuevas funcionalidades en cada versión, y https://github.com/quarkiverse[Quarkiverse] propone numerosas extensiones que habilitan la _Reactividad_ .

source: Quarkus REST: an implementation of Jakarta REST tailored for the Quarkus architecture. It follows a reactive-first approach but allows imperative code using the `@Blocking` annotation.
es_es: Quarkus REST: una implementación de Jakarta REST adaptada a la arquitectura de Quarkus. Sigue un enfoque reactivo-primero pero permite código imperativo mediante la anotación `@Blocking`.

source: Reactive Routes: a declarative way to register HTTP routes directly on the Vert.x router used by Quarkus to route HTTP requests to methods.
es_es: Rutas Reactivas: una forma declarativa de registrar rutas HTTP directamente en el enrutador Vert.x utilizado por Quarkus para dirigir las solicitudes HTTP a los métodos correspondientes.

source: REST Client: allows consuming HTTP endpoints. Under the hood, it uses the non-blocking I/O features from Quarkus.
es_es: Cliente REST: permite consumir enpoints HTTP. Bajo el capó, utiliza las funcionalidades de E/S no bloqueante de Quarkus.

source: Qute - the Qute template engine exposes a reactive API to render templates in a non-blocking manner.
es_es: Qute: el motor de plantillas de Qute expone una API reactiva para renderizar plantillas de manera no bloqueante.

source: Data
es_es: Datos

source: Hibernate Reactive: a version of Hibernate ORM using asynchronous and non-blocking clients to interact with the database.
es_es: Hibernate Reactive: una versión de Hibernate ORM que utiliza clientes asíncronos y no bloqueantes para interactuar con la base de datos.

source: Hibernate Reactive with Panache: provide active record and repository support on top of Hibernate Reactive.
es_es: Hibernate Reactive con Panache: proporciona soporte de registros y repositorios activos sobre Hibernate Reactive.

source: Reactive PostgreSQL client: an asynchronous and non-blocking client interacting with a PostgreSQL database, allowing high concurrency.
es_es: Cliente PostgreSQL reactivo: un cliente asíncrono y no bloqueante que interactúa con una base de datos PostgreSQL, permitiendo alta concurrencia.

source: Reactive MySQL client: an asynchronous and non-blocking client interacting with a MySQL database
es_es: Cliente MySQL reactivo: un cliente asíncrono y no bloqueante que interactúa con una base de datos MySQL

source: The MongoDB extension: exposes an imperative and reactive (Mutiny) APIs to interact with MongoDB.
es_es: La extensión de MongoDB: expone APIs imperativas y reactivas (Mutiny) para interactuar con MongoDB.

source: Mongo with Panache offers active record support for both the imperative and reactive APIs.
es_es: Mongo con Panache: ofrece soporte de active record tanto para las APIs imperativas como reactivas.

source: The Cassandra extension: exposes an imperative and reactive (Mutiny) APIs to interact with Cassandra
es_es: La extensión de Cassandra: expone APIs imperativas y reactivas (Mutiny) para interactuar con Cassandra

source: The Redis extension: exposes an imperative and reactive (Mutiny) APIs to store and retrieve data from a Redis key-value store.
es_es: La extensión de Redis: expone APIs imperativas y reactivas (Mutiny) para almacenar y recuperar datos desde un almacén clave-valor Redis.

source: Event-Driven Architecture
es_es: Arquitectura dirigida por eventos

source: Reactive Messaging: allows implementing event-driven applications using reactive and imperative code.
es_es: Mensajería Reactiva: permite implementar aplicaciones dirigidas por eventos utilizando código reactivo e imperativo.

source: Kafka Connector for Reactive Messaging: allows implementing applications consuming and writing Kafka records
es_es: Conector Kafka para mensajería reactiva: permite implementar aplicaciones que consumen y escriben registros en Kafka

source: AMQP 1.0 Connector for Reactive Message: allows implementing applications sending and receiving AMQP messages.
es_es: Conector AMQP 1.0 para Mensajería Reactiva: permite implementar aplicaciones que envían y reciben mensajes AMQP.

source: Network Protocols and Utilities
es_es: Protocolos y utilidades de red

source: gRPC: implement and consume gRPC services. Offer reactive and imperative programming interfaces.
es_es: gRPC: permite implementar y consumir servicios gRPC. Ofrece interfaces de programación reactivas e imperativas.

source: GraphQL: implement and query (client) data store using GraphQL. Offers Mutiny APIs and subscriptions as event streams.
es_es: GraphQL: permite implementar y consultar (como cliente) un almacén de datos utilizando GraphQL. Ofrece APIs Mutiny y suscripciones como flujos de eventos.
