Repository: quarkusio/es.quarkus.io
Catalog: l10n/po/*/_versions/3.2/guides/amqp.adoc.po
Languages: es_es

source: Getting Started to SmallRye Reactive Messaging with AMQP 1.0
es_es: Introducción a SmallRye Reactive Messaging con AMQP 1.0

source: This guide demonstrates how your Quarkus application can utilize SmallRye Reactive Messaging to interact with AMQP 1.0.
es_es: Esta guía demuestra cómo su aplicación Quarkus puede utilizar SmallRye Reactive Messaging para interactuar con AMQP 1.0.

source: Prerequisites
es_es: Requisitos previos

source: Architecture
es_es: Arquitectura

source: The second application, the `processor`, in turn, will read from the `quote-requests` queue put a random price to the quote, and send it to a queue named `quotes`.
es_es: La segunda aplicación, la `processor`, a su vez, leerá de la cola `quote-requests` poner un precio aleatorio a la cotización, y lo enviará a una cola llamada `quotes`.

source: Solution
es_es: Solución

source: Clone the Git repository: `git clone {quickstarts-clone-url}`, or download an {quickstarts-archive-url}[archive].
es_es: Clone el repositorio Git: `git clone {quickstarts-clone-url}` o descargue un {quickstarts-archive-url}[archivo].

source: Creating the Maven Project
es_es: Creación del proyecto Maven

source: First, we need to create two projects: the _producer_ and the _processor_.
es_es: En primer lugar, tenemos que crear dos proyectos: el _productor_ y el _procesador_.

source: To create the _producer_ project, in a terminal run:
es_es: Para crear el proyecto _productor_, en un terminal ejecute:

source: This command creates the project structure and select the two Quarkus extensions we will be using:
es_es: Este comando crea la estructura del proyecto y selecciona las dos extensiones de Quarkus que vamos a utilizar:

source: RESTEasy Reactive and its Jackson support to handle JSON payloads
es_es: RESTEasy Reactive y su soporte Jackson para manejar cargas útiles JSON

source: The Reactive Messaging AMQP connector
es_es: El conector AMQP de mensajería reactiva

source: To create the _processor_ project, from the same directory, run:
es_es: Para crear el proyecto del _procesador_, desde el mismo directorio, ejecute:

source: At that point you should have the following structure:
es_es: En ese momento deberías tener la siguiente estructura:

source: Open the two projects in your favorite IDE.
es_es: Abra los dos proyectos en su IDE favorito.

source: The Quote object
es_es: El objeto Cotización

source: Quarkus has built-in capabilities to deal with JSON AMQP messages.
es_es: Quarkus tiene capacidades incorporadas para tratar con mensajes JSON AMQP.

source: Sending quote request
es_es: Envío de solicitud de presupuesto

source: Inject a Reactive Messaging `Emitter` to send messages to the `quote-requests` channel.
es_es: Inyectar una Mensajería Reactiva `Emitter` para enviar mensajes al canal `quote-requests`.

source: On a post request, generate a random UUID and send it to the AMQP queue using the emitter.
es_es: En una solicitud de publicación, genera un UUID aleatorio y lo envía a la cola AMQP utilizando el emisor.

source: When you have multiple connectors, you would need to indicate which connector you want to use in the application configuration.
es_es: Si tiene varios conectores, deberá indicar qué conector desea utilizar en la configuración de la aplicación.

source: Processing quote requests
es_es: Tramitación de solicitudes de quota

source: Indicates that the method consumes the items from the `requests` channel
es_es: Indica que el método consume los elementos del canal `requests`

source: Indicates that the objects returned by the method are sent to the `quotes` channel
es_es: Indica que los objetos devueltos por el método se envían al canal `quotes`

source: Indicates that the processing is _blocking_ and cannot be run on the caller thread.
es_es: Indica que el procesamiento está _bloqueando_ y no puede ser ejecutado en el hilo de la llamada.

source: The `process` method is called for every AMQP message from the `quote-requests` queue, and will send a `Quote` object to the `quotes` queue.
es_es: El método `process` es llamado por cada mensaje AMQP de la cola `quote-requests`, y enviará un objeto `Quote` a la cola `quotes`.

source: The configuration keys are structured as follows:
es_es: Las claves de configuración están estructuradas de la siguiente manera:

source: In our case, we want to configure the `address` attribute to indicate the name of the queue.
es_es: En nuestro caso, queremos configurar el atributo `address` para indicar el nombre de la cola.

source: Receiving quotes
es_es: Recepción de presupuestos

source: Injects the `quotes` channel using the `@Channel` qualifier
es_es: Inyecta el canal `quotes` utilizando el calificador `@Channel`

source: Indicates that the content is sent using `Server Sent Events`
es_es: Indica que el contenido se envía utilizando `Server Sent Events`

source: Returns the stream (_Reactive Stream_)
es_es: Devuelve el flujo _(Reactive Stream_)

source: The HTML page
es_es: La página HTML

source: Final touch, the HTML page reading the converted prices using SSE.
es_es: El toque final, la página HTML que lee los precios convertidos usando SSE.

source: Create inside the `producer` project `src/main/resources/META-INF/resources/quotes.html` file, with the following content:
es_es: Cree dentro del proyecto `producer` el archivo `src/main/resources/META-INF/resources/quotes.html`, con el siguiente contenido:

source: Get it running
es_es: Ponerlo en marcha

source: You just need to run both applications using:
es_es: Sólo tienes que ejecutar ambas aplicaciones utilizando:

source: And, in a separate terminal:
es_es: Y, en una terminal separada:

source: Open `http://localhost:8080/quotes.html` in your browser and request some quotes by clicking the button.
es_es: Abra `http://localhost:8080/quotes.html` en su navegador y solicite algunos presupuestos haciendo clic en el botón.

source: Running in JVM or Native mode
es_es: Ejecución en modo JVM o nativo

source: First, make sure you stopped the applications, and build both applications in JVM mode with:
es_es: En primer lugar, asegúrese de que ha detenido las aplicaciones, y construya ambas aplicaciones en modo JVM con:

source: To run your applications as native, first we need to build the native executables:
es_es: Para ejecutar tus aplicaciones como nativas, primero tenemos que construir los ejecutables nativos:

source: As before, the UI is exposed on http://localhost:8080/quotes.html
es_es: Como antes, la interfaz de usuario está expuesta en http://localhost:8080/quotes.html

source: Going further
es_es: Ir más allá
