Repository: quarkusio/es.quarkus.io
Catalog: l10n/po/*/faq.md.po
Languages: es_es

source: Get answers to some of your common Quarkus questions.
es_es: Obtenga respuestas a algunas de sus preguntas comunes sobre Quarkus

source: What is your license?
es_es: ¿Qué licencia tiene?

source: Quarkus is an Open Source project licensed under the [Apache License version 2.0](https://www.apache.org/licenses/LICENSE-2.0).
es_es: Quarkus es un proyecto de código abierto con licencia [Apache License version 2.0](https://www.apache.org/licenses/LICENSE-2.0).

source: Where can I get it?
es_es: ¿Dónde puedo conseguirlo?

source: Quarkus is published in Maven Central, check out [which extensions](/extensions) you need and just import them in your `pom.xml` to get Quarkus. We recommend you start your Quarkus experience via our [Getting Started guides](/get-started).
es_es: Quarkus está publicado en Maven Central, comprueba [qué extensiones(/extensions) necesitas y simplemente impórtalas en tu `pom.xml` para obtener Quarkus. Te recomendamos que comiences tu experiencia con Quarkus a través de nuestras [Guías de inicio](/get-started).

source: Quarkus is stable?
es_es: ¿Quarkus es estable?

source: Yes, we consider Quarkus stable. Remember 95% of the features Quarkus apps use are provided by the ecosystem like Hibernate ORM, Eclipse Vert.x, Netty, RESTEasy, etc. These libraries are rock solid :)
es_es: Sí, creemos que Quarkus es estable. Recuerde que el 95 % de las funciones que usan las aplicaciones de Quarkus las proporciona el ecosistema como Hibernate ORM, Eclipse Vert.x, Netty, RESTEasy, etc. Estas bibliotecas son sólidas como una roca :)

source: You can go to [code.quarkus.io](https://code.quarkus.io/) to see if a particular extension is _stable_ (default) or _preview_.
es_es: Puedes ir a https://code.quarkus.io/[code.quarkus.io] para ver si una extensión en particular es _stable_ (default) o _preview_.

source: What is a Quarkus extension?
es_es: ¿Qué es una extensión de Quarkus?

source: One of the main goals of Quarkus is ease of extensibility and to build a vibrant ecosystem.
es_es: Uno de los principales objetivos de Quarkus es la facilidad de extensibilidad y la construcción de un ecosistema vibrante

source: Think of Quarkus extensions as your project dependencies. Extensions configure, boot and integrate a framework or technology into your Quarkus application. They also do all of the heavy lifting of providing the right information to GraalVM for your application to compile natively. This will allow 3rd party projects to easily take advantage of the work we have done to make it easier to target GraalVM.
es_es: Piense en las extensiones de Quarkus como dependencias de su proyecto. Las extensiones configuran, arrancan e integran marcos o tecnologías en su aplicación de Quarkus, y ademas hacen todo el trabajo pesado de proporcionar la información correcta a GraalVM para que su aplicación se compile de forma nativa. Esto permite que los proyectos de terceros aprovechen fácilmente el trabajo que hemos realizado para que sea más fácil apuntar a GraalVM

source: What are the extension statuses?
es_es: ¿Cuáles son los estados de las extensiones?

source: Extensions have a various degree of maturity when they enter the Quarkus ecosystem. A status offers the expectations you can rely on.
es_es: Las extensiones tienen varios grados de madurez a medida que ingresan al ecosistema de Quarkus. El estado ofrece el valor esperado de confianza

source: **Preview**: backward compatibility and presence in the ecosystem is not guaranteed. Specific improvements might require to change configuration or APIs and plans to become _stable_ are under way. Such extensions are in the middle of their maturation process.
es_es: *Preview*: la compatibilidad con versiones anteriores y la presencia en el ecosistema no están garantizadas. Ciertas mejoras pueden requerir cambios de configuración o API, y hay planes en marcha para volverse _stable_. Estas extensiones están en medio del proceso de maduración.

source: **Experimental**: early feedback is requested to mature the idea. There is no guarantee of stability nor long term presence in the platform until the solution matures. Such extensions are at the beginning of their maturation process.
es_es: *Experimental*: se solicita retroalimentación temprana para madurar la idea. No hay garantía de estabilidad ni presencia a largo plazo en la plataforma hasta que la solución madure. Dichas extensiones están al comienzo de su proceso de maduración.

source: You can find the extension status on [code.quarkus.io](https://code.quarkus.io) or in the extension [guides](/guides/).
es_es: Puede encontrar el estado de la extensión en https://code.quarkus.io[code.quarkus.io] o en el enlace de la extensión link:/guides/[guides].

source: Will the Quarkus team accept my extension?
es_es: ¿El equipo de Quarkus aceptará mi extensión?

source: Oh yeah! We had quite a few extensions written outside the Quarkus "initial" team.
es_es: ¡Por supuesto! Se ha creado un número significativo de extensiones fuera del equipo" inicial "de Quarkus.

source: Quarkus is an open ecosystem and we hope to see all the extensions people need to write their apps. We are working as we speak to allow an extension to be published in separate repos and separate GAVs and thus published in Maven repos independently of Quarkus core. This will greatly simplify the publication process. Expect news soon.
es_es: Quarkus es un ecosistema abierto y espera tener todas las extensiones que la gente necesita para crear aplicaciones. Estamos trabajando mientras hablamos para permitir que una extensión se publique en repositorios y GAV separados, por lo tanto, se publique en repositorios Maven independientes del core de Quarkus. Esto simplificará enormemente el proceso de publicación. Espere noticias pronto

source: The one current restriction is that extensions should work in both OpenJDK and GraalVM native executables. That is the guarantee we give Quarkus users (a cross compilation for their app). We have a maturity model to improve an extension to be fully "Quarked" and benefit from Quarkus, all done in incremental steps. Just hop on our [mailing list](https://quarkus.io/community/#discussions) to discuss your ideas and get help. And you can start reading our [Writing extensions guide](https://quarkus.io/guides/writing-extensions) as well or more simply get inspiration from the [existing ones](https://github.com/quarkusio/quarkus/tree/master/extensions).
es_es: La limitacion actual es que las extensiones deben funcionar con los ejecutables nativos de OpenJDK y GraalVM. Esta es una garantía que brindamos a los usuarios de Quarkus (compilación cruzada de aplicaciones). Tenemos un modelo de madurez para mejorar una extensión para que sea completamente "Quarked" y beneficiarse de Quarkus, todo hecho en pasos incrementales. Visite https://quarkus.io/community/#discussions[mailing list] para discutir ideas y obtener apoyo. También puede comenzar a leer https://quarkus.io/guides/writing-extensions[Writing extensions guide] o puede inspirarse en https://github.com/quarkusio/quarkus/tree/main/extensions[existing ones].

source: What is GraalVM?
es_es: ## ¿Qué es GraalVM?

source: [GraalVM](https://www.graalvm.org) is a universal virtual machine for running applications written in various different languages, as well as providing the ability to compile JVM bytecode to a native executable (this native executable runs a special virtual machine called SubstrateVM). These native executables start much faster and can use a lot less memory than a traditional JVM, however not every JVM feature is supported, and some are more limited than normal.
es_es: https://www.graalvm.org[GraalVM] es una máquina virtual universal para ejecutar aplicaciones escritas en varios lenguajes diferentes, además de brindar la capacidad de compilar código de bytes JVM en un ejecutable nativo (este ejecutable nativo ejecuta una maquina virtual especial llamada SubstrateVM). Estos ejecutables nativos se inician mucho más rápido y pueden usar mucha menos memoria que una JVM tradicional, sin embargo, no todas las funciones de JVM son compatibles y algunas son más limitadas de lo normal.

source: For example by default reflection in GraalVM will not work, unless a class/member has been explicitly registered for reflection. This is normally achieved by listing every class, method, field and constructor in a JSON file, and passing this as a parameter into the native image build. This obviously gets quite cumbersome for all but the most trivial projects. Quarkus provides a framework that makes it easy to work around these annotations, and programmatically determine what should be registered.
es_es: Por ejemplo, de forma predeterminada, la reflexión en GraalVM no funcionará, a menos que una clase/miembro se haya registrado explícitamente para la reflexión. Esto normalmente se logra listando cada clase, método, campo y constructor en un archivo JSON, y pasándolo como un parámetro Obviamente, esto se vuelve bastante engorroso para todos los proyectos, excepto para los más triviales. Quarkus proporciona un marco que facilita el trabajo en torno a estas anotaciones y proporciona un marco que le permite decidir mediante programación qué registrar

source: How do you unify imperative and reactive programming?
es_es: ## ¿Cómo se unifica la programación imperativa y reactiva?

source: What does Container First mean?
es_es: ## ¿Qué significa Container First?

source: What is your view on standards?
es_es: ## ¿Cuál es su punto de vista sobre los estándares?

source: What are you doing to improve developer joy?
es_es: ## ¿Qué estás haciendo para mejorar la alegría de los desarrolladores?
