Repository: quarkusio/es.quarkus.io
Catalog: l10n/po/*/security.md.po
Languages: es_es

source: The Quarkus team and community take all security bugs very seriously. You can find our guidelines here regarding our policy and security disclosure.
es_es: El equipo y la comunidad de Quarkus se toman muy en serio todos los errores de seguridad. Puede encontrar nuestras pautas aquí con respecto a nuestra política y divulgación de seguridad

source: Security
es_es: Seguridad

source: Reporting security issues
es_es: Reportando problemas de seguridad

source: Please report any security issues you find in Quarkus to:
es_es: Por favor informe cualquier problema de seguridad que encuentre en Quarkus a:

source: Anyone can post to this list. The subscribers are only trusted individuals from the Quarkus community who will handle the resolution of any reported security issues in confidence. In your report, please note how you would like to be credited for discovering the issue and the details of any embargo you would like to impose. Currently the security response teams for the following distributions are subscribed to this list and will respond to your report: [Red Hat](https://access.redhat.com/security/team/contact/)
es_es: Cualquiera puede publicar en esta lista. Los suscriptores son solo personas de confianza de la comunidad de Quarkus que se encargarán de la resolución de cualquier problema de seguridad informado de forma confidencial. En su informe, indique cómo le gustaría recibir crédito por descubrir el problema. Actualmente, los equipos de respuesta de seguridad para las siguientes distribuciones están suscritos a esta lista y responderán a su informe: [Red Hat](https://access.redhat.com/security/team/contact/)

source: Quarkus is an ecosystem made from many extensions and many libraries (like Eclipse Vert.x, Hibernate, Apache Camel and more), most of them not under the direct responsibility of the Quarkus team. If you find a security bug possibly rooted in one of these libraries, you can either disclose to them directly or disclose them to the Quarkus team (following this process) and we will responsibly disclose the issue to the respective extension or library maintainer.
es_es: Quarkus es un ecosistema hecho de muchas extensiones y muchas bibliotecas (como Eclipse Vert.x, Hibernate, Apache Camel y más), la mayoría de las cuales no están directamente bajo la responsabilidad directa del equipo de Quarkus. Si encuentra un error de seguridad en una de estas bibliotecas, puede comunicárselas directamente o al equipo de Quarkus (siguiendo este proceso) y divulgaremos el problema de manera responsable al mantenedor de la biblioteca o de la extensión respectiva.

source: Why follow this process
es_es: ¿Por qué seguir este proceso?

source: Due to the sensitive nature of security bugs, the disclosure process is more constrained than a regular bug. We appreciate you following these industry accepted guidelines, which gives time for a proper fix and limit the time window of attack.
es_es: Debido a la naturaleza delicada de los errores de seguridad, el proceso de divulgación es más restringido que un error normal. Agradecemos que siga estas pautas aceptadas por la industria, lo que le da tiempo para una corrección adecuada y limita la ventana de tiempo del ataque.

source: Supported Versions
es_es: Versiones compatibles

source: The community will fix security bugs for the latest major.minor version published at [https://quarkus.io/get-started/](https://quarkus.io/get-started/).
es_es: La comunidad corregirá los errores de seguridad para la última versión major.minor publicada en [https://quarkus.io/get-started/](https://quarkus.io/get-started/).

source: We may fix the vulnerability to older versions depending on the severity of the issue and the age of the release, but we are only committing to the latest version released.
es_es: Dependiendo de la gravedad del problema y la antigüedad del lanzamiento, es posible que corrijamos la vulnerabilidad a una versión anterior, pero solo nos comprometemos con la última versión lanzada.

source: Handling security issues
es_es: Manejo de problemas de seguridad

source: If you represent a Quarkus extension or a Quarkus platform, you are welcome to subscribe to the security at quarkus.io mailing list. Your subscription will only be approved if you can demonstrate that you will handle issues in confidence and properly credit reporters for discovering issues (e.g. experience with embargoe process).
es_es: Si usted representa una extensión o una plataforma de Quarkus, le invitamos a suscribirse a la lista de correo de seguirdad en quarkus.io. Su suscripción solo será aprobada si puede demostrar que manejar el problema de forma confidencial y acreditará adecuadamente a los reporteros por el descubrimiento de problemas (por ejemplo, experiencia con el proceso de embargo).
