Repository: quarkusio/es.quarkus.io
Catalog: l10n/po/*/_versions/3.27/guides/qute.adoc.po
Languages: es_es

source: Qute Templating Engine
es_es: Motor de plantillas Qute

source: Qute is a templating engine developed specifically for Quarkus. Reflection usage is minimized to reduce the size of native images. The API combines both the imperative and the non-blocking reactive style of coding. In development mode, all files located in `src/main/resources/templates` are monitored for changes, and modifications become visible immediately. Furthermore, we aim to detect most template issues at build time. In this guide, you will learn how to easily render templates in your application.
es_es: Qute es un motor de plantillas desarrollado específicamente para Quarkus. Se minimiza el uso de la reflexión para reducir el tamaño de las imágenes nativas. La API combina tanto el estilo de codificación imperativo como el reactivo no bloqueante. En el modo de desarrollo, todos los archivos ubicados en `src/main/resources/templates` se supervisan en busca de cambios, y las modificaciones se hacen visibles inmediatamente. Además, nuestro objetivo es detectar la mayoría de los problemas de plantilla en el momento de la compilación. En esta guía, aprenderá a renderizar fácilmente plantillas en su aplicación.

source: Solution
es_es: Solución

source: We recommend that you follow the instructions in the next sections and create the application step by step. However, you can go right to the completed example.
es_es: Recomendamos que siga las instrucciones de las siguientes secciones y cree la aplicación paso a paso. Sin embargo, también puede ir directamente al ejemplo completo.

source: Clone the Git repository: `git clone {quickstarts-clone-url}`, or download an {quickstarts-archive-url}[archive].
es_es: Clone el repositorio Git: `git clone {quickstarts-clone-url}` o descargue un {quickstarts-archive-url}[archivo].

source: The solution is located in the `qute-quickstart` link:{quickstarts-tree-url}/qute-quickstart[directory].
es_es: La solución se encuentra en el `qute-quickstart` link:{quickstarts-tree-url}/qute-quickstart[directorio].

source: Serving Qute templates via HTTP
es_es: Servir plantillas Qute a través de HTTP

source: If you want to serve your templates via HTTP:
es_es: Si desea servir sus plantillas a través de HTTP:

source: The Qute Web extension allows you to directly serve via HTTP templates located in `src/main/resources/templates/pub/`. In that case you don't need any Java code to "plug" the template, for example, the template `src/main/resources/templates/pub/foo.html` will be served from the paths `/foo` and `/foo.html` by default.
es_es: La extensión Web de Qute le permite servir directamente a través de HTTP plantillas ubicadas en `src/main/resources/templates/pub/`. En ese caso no necesita ningún código Java para "conectar" la plantilla, por ejemplo, la plantilla `src/main/resources/templates/pub/foo.html` se servirá desde las rutas `/foo` y `/foo.html` por defecto.

source: For finer control, you can combine it with Quarkus REST to control how your template will be served. All files located in the `src/main/resources/templates` directory and its subdirectories are registered as templates and can be injected in a REST resource.
es_es: Para un control más fino, puede combinarlo con Quarkus REST para controlar cómo se servirá su plantilla. Todos los archivos ubicados en el directorio `src/main/resources/templates` y sus subdirectorios se registran como plantillas y pueden inyectarse en un recurso REST.

source: The Qute Web extension, while hosted in the Quarkiverse, is part of the Quarkus Platform and its version is defined in the Quarkus Platform BOM.
es_es: La extensión Qute Web, aunque está alojada en Quarkiverse, forma parte de Quarkus Platform y su versión está definida en la lista de materiales de Quarkus Platform.

source: Serving Hello World with Qute
es_es: Sirviendo Hola Mundo con Qute

source: Let's start with a Hello World template:
es_es: Empecemos con una plantilla Hola Mundo:

source: `{http:param('name', 'Quarkus')}` is an expression that is evaluated when the template is rendered (Quarkus is the default value).
es_es: `{http:param('name', 'Quarkus')}` es una expresión que se evalúa cuando se renderiza la plantilla (Quarkus es el valor por defecto).

source: Templates located in the `pub` directory are served via HTTP. This behavior is built-in, no controllers are needed. For example, the template `src/main/resources/templates/pub/foo.html` will be served from the paths `/foo` and `/foo.html` by default.
es_es: Las plantillas ubicadas en el directorio `pub` se sirven a través de HTTP. Este comportamiento está incorporado, no se necesitan controladores. Por ejemplo, la plantilla `src/main/resources/templates/pub/foo.html` se servirá desde las rutas `/foo` y `/foo.html` por defecto.

source: Once your application is running, you can open your browser and navigate to: http://localhost:8080/hello?name=Martin
es_es: Una vez que su aplicación se esté ejecutando, puede abrir su navegador y navegar a: http://localhost:8080/hello?name=Martin

source: For more information about Qute Web options, see the https://docs.quarkiverse.io/quarkus-qute-web/dev/index.html[Qute Web guide].
es_es: Para más información sobre las opciones de Qute Web, consulte la link:https://docs.quarkiverse.io/quarkus-qute-web/dev/index.html[guía de Qute Web].

source: Hello Qute and REST
es_es: Hola Qute y REST

source: For finer control, you can combine Qute Web with Quarkus REST (formerly RESTEasy Reactive) or the legacy RESTEasy Classic-based extension to control how your template will be served
es_es: Para un control más preciso, puede combinar Qute Web con Quarkus REST (anteriormente RESTEasy Reactive) o la extensión heredada basada en RESTEasy Classic para controlar cómo se servirá su plantilla.

source: Using the `quarkus-rest-qute` extension:
es_es: Utilizando la extensión `quarkus-rest-qute`:

source: A very simple text template:
es_es: Una plantilla de texto muy sencilla:

source: `{name}` is a value expression that is evaluated when the template is rendered.
es_es: `{name}` es una expresión de valor que se evalúa cuando se renderiza la plantilla.

source: Now let's inject the "compiled" template in the resource class.
es_es: Ahora vamos a inyectar la plantilla "compilada" en la clase de recursos.

source: If there is no `@Location` qualifier provided, the field name is used to locate the template. In this particular case, we're injecting a template with path `templates/hello.txt`.
es_es: Si no se proporciona el calificador `@Location`, se utiliza el nombre del campo para localizar la plantilla. En este caso particular, estamos inyectando una plantilla con la ruta `templates/hello.txt`.

source: `Template.data()` returns a new template instance that can be customized before the actual rendering is triggered. In this case, we put the name value under the key `name`. The data map is accessible during rendering.
es_es: `Template.data()` devuelve una nueva instancia de plantilla que se puede personalizar antes de que se active el renderizado real. En este caso, ponemos el valor del nombre bajo la clave `name`. El mapa de datos es accesible durante el renderizado.

source: Note that we don't trigger the rendering - this is done automatically by a special `ContainerResponseFilter` implementation provided by `quarkus-rest-qute`.
es_es: Tenga en cuenta que nosotros no activamos la renderización - esto lo hace automáticamente una implementación especial de `ContainerResponseFilter` proporcionada por `quarkus-rest-qute`.

source: If your application is running, you can request the endpoint:
es_es: Si su aplicación se está ejecutando, puede solicitar el punto final:

source: Type-safe templates
es_es: Plantillas con seguridad de tipos

source: There's an alternate way to declare your templates in your Java code, which relies on the following convention:
es_es: Hay una forma alternativa de declarar sus plantillas en su código Java, que se basa en la siguiente convención:

source: Organize your template files in the `/src/main/resources/templates` directory, by grouping them into one directory per resource class. So, if your `FruitResource` class references two templates `apples` and `oranges`, place them at `/src/main/resources/templates/FruitResource/apples.txt` and `/src/main/resources/templates/FruitResource/oranges.txt`. Grouping templates per resource class makes it easier to navigate to them.
es_es: Organice sus archivos de plantillas en el directorio `/src/main/resources/templates`, agrupándolos en un directorio por cada clase de recurso. Así, si su clase `FruitResource` hace referencia a dos plantillas `apples` y `oranges`, colóquelas en `/src/main/resources/templates/FruitResource/apples.txt` y `/src/main/resources/templates/FruitResource/oranges.txt`. Agrupar las plantillas por clase de recurso facilita la navegación hasta ellas.

source: In each of your resource class, declare a `@CheckedTemplate static class Template {}` class within your resource class.
es_es: En cada una de sus clases de recursos, declare una clase `@CheckedTemplate static class Template {}` dentro de su clase de recursos.

source: Declare one `public static native TemplateInstance method();` per template file for your resource.
es_es: Declare un `public static native TemplateInstance method();` por archivo de plantilla para su recurso.

source: Use those static methods to build your template instances.
es_es: Utilice esos métodos estáticos para construir sus instancias de plantilla.

source: Here's the previous example, rewritten using this style:
es_es: Este es el ejemplo anterior, reescrito con este estilo:

source: We'll start with a very simple template:
es_es: Empezaremos con una plantilla muy sencilla:

source: Now let's declare and use this template in the resource class.
es_es: Ahora vamos a declarar y utilizar esta plantilla en la clase de recursos.

source: This declares a template with path `templates/HelloResource/hello`.
es_es: Esto declara una plantilla con la ruta `templates/HelloResource/hello`.

source: `Templates.hello()` returns a new template instance that is returned from the resource method. Note that we don't trigger the rendering - this is done automatically by a special `ContainerResponseFilter` implementation provided by `quarkus-rest-qute`.
es_es: `Templates.hello()` devuelve una nueva instancia de plantilla que se devuelve desde el método del recurso. Tenga en cuenta que no activamos la renderización - esto lo hace automáticamente una implementación especial de `ContainerResponseFilter` proporcionada por `quarkus-rest-qute`.

source: Once you have declared a `@CheckedTemplate` class, we will check that all its methods point to existing templates, so if you try to use a template from your Java code and you forgot to add it, we will let you know at build time :)
es_es: Una vez que haya declarado una clase `@CheckedTemplate`, comprobaremos que todos sus métodos apuntan a plantillas existentes, así que si intenta utilizar una plantilla de su código Java y se olvidó de añadirla, se lo haremos saber en el momento de la compilación :)

source: Keep in mind this style of declaration allows you to reference templates declared in other resources too:
es_es: Tenga en cuenta que este estilo de declaración le permite referenciar plantillas declaradas en otros recursos también:

source: Top-level type-safe templates
es_es: Plantillas de nivel superior con seguridad de tipos

source: Naturally, if you want to declare templates at the top-level, directly in `/src/main/resources/templates/hello.txt`, for example, you can declare them in a top-level (non-nested) `Templates` class:
es_es: Naturalmente, si desea declarar plantillas en el nivel superior, directamente en `/src/main/resources/templates/hello.txt`, por ejemplo, puede declararlas en una clase de nivel superior (no anidada) `Templates`:

source: This declares a template with path `templates/hello`.
es_es: Esto declara una plantilla con la ruta `templates/hello`.

source: Template Parameter Declarations
es_es: Declaraciones de parámetros de plantillas

source: If you declare a *parameter declaration* in a template then Qute attempts to validate all expressions that reference this parameter and if an incorrect expression is found the build fails.
es_es: Si declara una *declaración de parámetro* en una plantilla, Qute intenta validar todas las expresiones que hacen referencia a este parámetro y si se encuentra una expresión incorrecta la compilación falla.

source: Let's suppose we have a simple class like this:
es_es: Supongamos que tenemos una clase simple como esta:

source: And we'd like to render a simple HTML page that contains the item name and price.
es_es: Y nos gustaría renderizar una página HTML simple que contenga el nombre del artículo y el precio.

source: Let's start again with the template:
es_es: Empecemos de nuevo con la plantilla:

source: This expression is validated. Try to change the expression to `{item.nonSense}` and the build should fail.
es_es: Esta expresión está validada. Intente cambiar la expresión a `{item.nonSense}` y la compilación debería fallar.

source: This is also validated.
es_es: Esto también se valida.

source: Finally, let's create a resource class with type-safe templates:
es_es: Por último, vamos a crear una clase de recursos con plantillas con seguridad de tipos:

source: Declare a method that gives us a `TemplateInstance` for `templates/ItemResource/item.html` and declare its `Item item` parameter so we can validate the template.
es_es: Declare un método que nos da un `TemplateInstance` para `templates/ItemResource/item.html` y declare su parámetro `Item item` para que podamos validar la plantilla.

source: Make the `Item` object accessible in the template.
es_es: Haga que el objeto `Item` sea accesible en la plantilla.

source: When the `--parameters` compiler argument is enabled, Quarkus REST may infer the parameter names from the method argument names, making the `@PathParam("id")` annotation optional in this case.
es_es: Cuando el argumento del compilador `--parameters` está habilitado, Quarkus REST puede inferir los nombres de los parámetros a partir de los nombres de los argumentos del método, haciendo que la anotación `@PathParam("id")` sea opcional en este caso.

source: Template parameter declaration inside the template itself
es_es: Declaración de parámetros de la plantilla dentro de la propia plantilla

source: Alternatively, you can declare your template parameters in the template file itself.
es_es: Alternativamente, puede declarar los parámetros de la plantilla en el propio archivo de la plantilla.

source: Optional parameter declaration. Qute attempts to validate all expressions that reference the parameter `item`.
es_es: Declaración opcional del parámetro. Qute intenta validar todas las expresiones que hacen referencia al parámetro `item`.

source: Finally, let's create a resource class.
es_es: Por último, vamos a crear una clase de recursos.

source: Inject the template with path `templates/item.html`.
es_es: Inyecte la plantilla con la ruta `templates/item.html`.

source: Template Extension Methods
es_es: Métodos de extensión de plantillas

source: *Template extension methods* are used to extend the set of accessible properties of data objects.
es_es: Los *métodos de extensión de plantillas* se utilizan para ampliar el conjunto de propiedades accesibles de los objetos de datos.

source: Sometimes, you're not in control of the classes that you want to use in your template, and you cannot add methods to them. Template extension methods allow you to declare new methods for those classes that will be available from your templates just as if they belonged to the target class.
es_es: A veces, no tiene el control de las clases que desea utilizar en su plantilla y no puede añadirles métodos. Los métodos de extensión de plantillas le permiten declarar nuevos métodos para esas clases que estarán disponibles desde sus plantillas como si pertenecieran a la clase de destino.

source: Let's keep extending on our simple HTML page that contains the item name, price and add a discounted price. The discounted price is sometimes called a "computed property". We will implement a template extension method to render this property easily. Let's update our template:
es_es: Sigamos ampliando nuestra página HTML simple que contiene el nombre del artículo, el precio y añadamos un precio con descuento. El precio con descuento a veces se denomina "propiedad computada". Implementaremos un método de extensión de plantilla para renderizar esta propiedad fácilmente. Actualicemos nuestra plantilla:

source: `if` is a basic control flow section.
es_es: `if` es una sección de flujo de control básico.

source: This expression is also validated against the `Item` class and obviously there is no such property declared. However, there is a template extension method declared on the `TemplateExtensions` class - see below.
es_es: Esta expresión también se valida contra la clase `Item` y, obviamente, no hay tal propiedad declarada. Sin embargo, hay un método de extensión de plantilla declarado en la clase `TemplateExtensions` - véase más abajo.

source: Finally, let's create a class where we put all our extension methods:
es_es: Por último, vamos a crear una clase en la que pondremos todos nuestros métodos de extensión:

source: A static template extension method can be used to add "computed properties" to a data class. The class of the first parameter is used to match the base object and the method name is used to match the property name.
es_es: Se puede utilizar un método de extensión de plantilla estática para añadir "propiedades computadas" a una clase de datos. La clase del primer parámetro se utiliza para hacer coincidir el objeto base y el nombre del método se utiliza para hacer coincidir el nombre de la propiedad.

source: you can place template extension methods in every class if you annotate them with `@TemplateExtension` but we advise to keep them either grouped by target type, or in a single `TemplateExtensions` class by convention.
es_es: Puede colocar métodos de extensión de plantillas en cada clase si los anota con `@TemplateExtension`, pero le aconsejamos que los mantenga agrupados por tipo de destino o en una única clase `TemplateExtensions` por convención.

source: Rendering Periodic Reports
es_es: Renderizado de informes periódicos

source: The templating engine can also be very useful for rendering periodic reports. You'll need to add the `quarkus-scheduler` and `quarkus-qute` extensions first. In your `pom.xml` file, add:
es_es: El motor de plantillas también puede ser muy útil para renderizar informes periódicos. Primero tendrá que añadir las extensiones `quarkus-scheduler` y `quarkus-qute`. En su archivo `pom.xml`, añada:

source: Let's suppose we have a `SampleService` bean whose `get()` method returns a list of samples.
es_es: Supongamos que tenemos un bean `SampleService` cuyo método `get()` devuelve una lista de muestras.

source: The template is simple:
es_es: La plantilla es simple:

source: The loop section makes it possible to iterate over iterables, maps and streams.
es_es: La sección de bucle permite iterar sobre iterables, mapas y flujos.

source: This value expression is using the https://en.wikipedia.org/wiki/Elvis_operator[elvis operator] - if the name is null the default value is used.
es_es: Esta expresión de valor está utilizando el link:https://en.wikipedia.org/wiki/Elvis_operator[operador elvis] - si el nombre es nulo se utiliza el valor por defecto.

source: In this case, we use the `@Location` qualifier to specify the template path: `templates/reports/v1/report_01.html`.
es_es: En este caso, utilizamos el calificador `@Location` para especificar la ruta de la plantilla: `templates/reports/v1/report_01.html`.

source: Use the `@Scheduled` annotation to instruct Quarkus to execute this method on the half hour. For more information see the xref:scheduler.adoc[Scheduler] guide.
es_es: Utilice la anotación `@Scheduled` para indicar a Quarkus que ejecute este método cada media hora. Para más información, consulte la guía xref:scheduler.adoc[del Programador].

source: The `TemplateInstance.render()` method triggers rendering. Note that this method blocks the current thread.
es_es: El método `TemplateInstance.render()` desencadena la renderización. Tenga en cuenta que este método bloquea el hilo actual.

source: Qute Reference Guide
es_es: Guía de referencia Qute

source: To learn more about Qute, please refer to the xref:qute-reference.adoc[Qute reference guide].
es_es: Para saber más sobre Qute, consulte la xref:qute-reference.adoc[guía de referencia de Qute].

source: Qute Configuration Reference
es_es: Referencia de configuración de Qute

source: <span class="icon"><i class="fa fa-lock" title="Fixed at build time"></i></span> Configuration property fixed at build time - All other configuration properties are overridable at runtime <input type="search" id="config-search-0" placeholder="FILTER CONFIGURATION" disabled>
es_es: <span class="icon"><i class="fa fa-lock" title="Fijado en tiempo de compilación"></i></span> Propiedad de configuración fijada en tiempo de compilación - Todas las demás propiedades de configuración son anulables en tiempo de ejecución <input type="search" id="config-search-0" placeholder="CONFIGURACIÓN DEL FILTRO" disabled>
