Repository: quarkusio/es.quarkus.io
Catalog: l10n/po/*/_versions/2.13/guides/reaugmentation.adoc.po
Languages: es_es

source: Re-augment a Quarkus Application
es_es: Volver a medir una aplicación de Quarkus

source: What is augmentation?
es_es: ¿Qué es el proceso de aumento?

source: Quarkus application configuration may include two types of configuration options:
es_es: La configuración de la aplicación Quarkus puede incluir dos tipos de opciones de configuración:

source: Build time options, handled during the application build time;
es_es: Opciones de tiempo de construcción, manejadas durante el tiempo de construcción de la aplicación;

source: Runtime options, that may be adjusted after the application has been built but before it has been launched.
es_es: Opciones de tiempo de ejecución, que pueden ajustarse después de la construcción de la aplicación pero antes de su lanzamiento.

source: Re-augmentation is the process of recreating the augmentation output for a different build time configuration
es_es: La re-aumentación es el proceso de recrear la salida de aumento para una configuración de tiempo de construcción diferente

source: When is re-augmentation useful?
es_es: ¿Cuándo es útil la re-aumentación?

source: How to re-augment a Quarkus application
es_es: Cómo volver a aumentar una aplicación de Quarkus

source: 1. Build your application as `mutable-jar`
es_es: 1. Construya su aplicación como `mutable-jar`

source: 2. Re-augment your application with a different build time configuration
es_es: 2. Vuelva a calibrar su aplicación con una configuración de tiempo de compilación diferente

source: In order to re-augment your Quarkus application with different build time properties, start the application with the desired configuration plus the `quarkus.launch.rebuild` system property set to `true`.
es_es: Para volver a aumentar su aplicación Quarkus con diferentes propiedades de tiempo de compilación, inicie la aplicación con la configuración deseada más la propiedad del sistema `quarkus.launch.rebuild` establecida en `true`.

source: The following example changes the `quarkus.datasource.db-kind` to `mysql`. For this to work the `mysql-extension` must have been included in the build. Augmentation can only use extensions that were present during compile time.
es_es: El siguiente ejemplo cambia el `quarkus.datasource.db-kind` por `mysql`. Para que esto funcione el `mysql-extension` debe haber sido incluido en la compilación. La ampliación sólo puede utilizar las extensiones que estaban presentes en el momento de la compilación.

source: 3. Optional: Delete the deployments folder
es_es: 3. Opcional: Eliminar la carpeta de despliegues

source: You may delete the directory `quarkus-app/lib/deployment` to save some space in your ZIP distribution or Docker image (remember to use a multistage Docker build to avoid unnecessary layers). After deleting the `deployment` directory, it is obviously not possible anymore to re-augment the application.
es_es: Puedes eliminar el directorio `quarkus-app/lib/deployment` para ahorrar algo de espacio en tu distribución ZIP o imagen Docker (recuerda utilizar una construcción Docker multietapa para evitar capas innecesarias). Después de eliminar el directorio `deployment`, obviamente ya no es posible volver a aumentar la aplicación.
