Repository: quarkusio/es.quarkus.io
Catalog: l10n/po/*/_versions/3.15/guides/amqp-reference.adoc.po
Languages: es_es

source: This instance is retrieved and used to configure the client used by the connector. You need to indicate the name of the client using the `client-options-name` attribute:
es_es: Esta instancia se recupera y se utiliza para configurar el cliente utilizado por el conector. Debe indicar el nombre del cliente utilizando el atributo `client-options-name`:

source: If you experience frequent disconnections from the broker, the `AmqpClientOptions` can also be used to set a heartbeat if you need to keep the AMQP connection permanently. Some brokers might terminate the AMQP connection after a certain idle timeout. You can provide a heartbeat value which will be used by the Vert.x proton client to advertise the idle timeout when opening transport to a remote peer.
es_es: Si experimenta desconexiones frecuentes del broker, también puede utilizar `AmqpClientOptions` para establecer un latido si necesita mantener la conexión AMQP de forma permanente. Algunos brokers pueden finalizar la conexión AMQP tras un determinado tiempo de espera inactivo. Puedes proporcionar un valor de latido que será utilizado por el cliente Proton de Vert.x para anunciar el tiempo de espera inactivo al abrir el transporte con un par remoto.

source: TLS Configuration
es_es: Configuración TLS

source: AMQP 1.0 Messaging extension integrates with the xref:./tls-registry-reference.adoc[Quarkus TLS registry] to configure the Vert.x AMQP client.
es_es: La extensión de mensajería AMQP 1.0 se integra con el xref:./tls-registry-reference.adoc[registro TLS de Quarkus] para configurar el cliente AMQP Vert.x.

source: To configure the TLS for an AMQP 1.0 channel, you need to provide a named TLS configuration in the `application.properties`:
es_es: Para configurar el TLS para un canal AMQP 1.0, debe proporcionar una configuración TLS con nombre en `application.properties`:

source: Health reporting
es_es: Informes de salud

source: If you use the AMQP connector with the `quarkus-smallrye-health` extension, it contributes to the readiness and liveness probes. The AMQP connector reports the readiness and liveness of each channel managed by the connector. At the moment, the AMQP connector uses the same logic for the readiness and liveness checks.
es_es: Si utiliza el conector AMQP con la extensión `quarkus-smallrye-health`, contribuye a las sondas de disponibilidad y actividad. El conector AMQP informa de la disponibilidad y actividad de cada canal gestionado por el conector. Por el momento, el conector AMQP utiliza la misma lógica para las comprobaciones de disponibilidad y actividad.

source: To disable health reporting, set the `health-enabled` attribute for the channel to false. On the inbound side (receiving messages from AMQP), the check verifies that the receiver is attached to the broker. On the outbound side (sending records to AMQP), the check verifies that the sender is attached to the broker.
es_es: Para desactivar los informes de salud, establezca el atributo `health-enabled` para el canal en false. En el lado de entrada (recepción de mensajes de AMQP), la comprobación verifica que el receptor está unido al broker. En el lado de salida (envío de registros a AMQP), la comprobación verifica que el remitente está unido al broker.

source: Note that a message processing failures nacks the message, which is then handled by the `failure-strategy`. It is the responsibility of the `failure-strategy` to report the failure and influence the outcome of the checks. The `fail` failure strategy reports the failure, and so the check will report the fault.
es_es: Tenga en cuenta que un fallo en el procesamiento de un mensaje lo anula y pasa a ser gestionado por `failure-strategy`. Es responsabilidad de `failure-strategy` informar del fallo e influir en el resultado de las comprobaciones. La estrategia de fallo de `fail` informa del fallo, por lo que la comprobación informará del fallo.

source: Using RabbitMQ
es_es: Uso de RabbitMQ

source: This connector is for AMQP 1.0. RabbitMQ implements AMQP 0.9.1. RabbitMQ does not provide AMQP 1.0 by default, but there is a plugin for it. To use RabbitMQ with this connector, enable and configure the AMQP 1.0 plugin.
es_es: Este conector es para AMQP 1.0. RabbitMQ implementa AMQP 0.9.1. RabbitMQ no proporciona AMQP 1.0 por defecto, pero existe un plugin para ello. Para utilizar RabbitMQ con este conector, habilite y configure el plugin AMQP 1.0.

source: Despite the existence of the plugin, a few AMQP 1.0 features won’t work with RabbitMQ. Thus, we recommend the following configurations.
es_es: A pesar de la existencia del plugin, algunas características de AMQP 1.0 no funcionarán con RabbitMQ. Así, recomendamos las siguientes configuraciones.

source: To receive messages from RabbitMQ:
es_es: Para recibir mensajes de RabbitMQ:

source: Set durable to false
es_es: Establecer la durabilidad en falso

source: To send messages to RabbitMQ:
es_es: Para enviar mensajes a RabbitMQ:

source: set the destination address (anonymous sender are not supported)
es_es: establecer la dirección de destino (no se admiten remitentes anónimos)

source: set `use-anonymous-sender` to false
es_es: establecer `use-anonymous-sender` en falso

source: As a consequence, it’s not possible to change the destination dynamically (using message metadata) when using RabbitMQ.
es_es: Como consecuencia, no es posible cambiar el destino dinámicamente (utilizando los metadatos del mensaje) cuando se utiliza RabbitMQ.

source: Receiving Cloud Events
es_es: Recepción de eventos en la nube

source: The AMQP connector supports https://cloudevents.io/[Cloud Events]. When the connector detects a _structured_ or _binary_ Cloud Events, it adds a `IncomingCloudEventMetadata<T>` into the metadata of the `Message`. `IncomingCloudEventMetadata` contains accessors to the mandatory and optional Cloud Event attributes.
es_es: El conector AMQP admite link:https://cloudevents.io/[eventos de la nube]. Cuando el conector detecta un evento de la nube _estructurado_ o _binario_ , añade un `IncomingCloudEventMetadata<T>` en los metadatos del `Message`. `IncomingCloudEventMetadata` contiene accesores a los atributos obligatorios y opcionales del evento de la nube.

source: If the connector cannot extract the Cloud Event metadata, it sends the Message without the metadata.
es_es: Si el conector no puede extraer los metadatos del evento en la nube, envía el mensaje sin los metadatos.

source: For more information on receiving Cloud Events, see https://smallrye.io/smallrye-reactive-messaging/smallrye-reactive-messaging/3.12/amqp/amqp.html#_receiving_cloud_events[Receiving Cloud Events] in SmallRye Reactive Messaging documentation.
es_es: Para obtener más información sobre la recepción de eventos de la nube, consulte https://smallrye.io/smallrye-reactive-messaging/smallrye-reactive-messaging/3.12/amqp/amqp.html#_receiving_cloud_events[Recepción de eventos de la nube] en la documentación de SmallRye Reactive Messaging.

source: Sending Cloud Events
es_es: Envío de eventos en la nube

source: The AMQP connector supports https://cloudevents.io/[Cloud Events]. The connector sends the outbound record as Cloud Events if:
es_es: El conector AMQP es compatible con Cloud link:https://cloudevents.io/[Events] . El conector envía el registro de salida como Cloud Events si:

source: the message metadata contains an `io.smallrye.reactive.messaging.ce.OutgoingCloudEventMetadata` instance,
es_es: los metadatos del mensaje contienen una instancia de `io.smallrye.reactive.messaging.ce.OutgoingCloudEventMetadata`,

source: the channel configuration defines the `cloud-events-type` and `cloud-events-source` attributes.
es_es: la configuración del canal define los atributos `cloud-events-type` y `cloud-events-source`.

source: For more information on sending Cloud Events, see https://smallrye.io/smallrye-reactive-messaging/smallrye-reactive-messaging/3.12/amqp/amqp.html#_sending_cloud_events[Sending Cloud Events] in SmallRye Reactive Messaging documentation.
es_es: Para obtener más información sobre el envío de eventos de nube, consulte https://smallrye.io/smallrye-reactive-messaging/smallrye-reactive-messaging/3.12/amqp/amqp.html#_sending_cloud_events[Envío de eventos de nube] en la documentación de SmallRye Reactive Messaging.

source: AMQP Connector Configuration Reference
es_es: Referencia de la configuración del conector AMQP

source: Quarkus specific configuration
es_es: Configuración específica de Quarkus

source: <span class="icon"><i class="fa fa-lock" title="Fixed at build time"></i></span> Configuration property fixed at build time - All other configuration properties are overridable at runtime <input type="search" id="config-search-0" placeholder="FILTER CONFIGURATION" disabled>
es_es: <span class="icon"><i class="fa fa-lock" title="Fijado en tiempo de compilación"></i></span> Propiedad de configuración fijada en tiempo de compilación - Todas las demás propiedades de configuración son anulables en tiempo de ejecución <input type="search" id="config-search-0" placeholder="CONFIGURACIÓN DEL FILTRO" disabled>

source: Incoming channel configuration
es_es: Configuración del canal de entrada

source: Attribute (_alias_)
es_es: Atributo _(alias_)

source: Description
es_es: Descripción

source: Mandatory
es_es: Obligatorio

source: Default
es_es: Por defecto

source: The AMQP address. If not set, the channel name is used Type: _string_
es_es: La dirección AMQP. Si no se establece, se utiliza el nombre del canal Type: _string_

source: false
es_es: falso

source: Whether the received AMQP messages must be acknowledged when received Type: _boolean_
es_es: Si los mensajes AMQP recibidos deben ser acusados de recibo Type: _boolean_

source: Whether the received AMQP messages must be dispatched to multiple _subscribers_ Type: _boolean_
es_es: Si los mensajes AMQP recibidos deben ser enviados a múltiples _suscriptores_ Type: _boolean_

source: A comma-separated list of capabilities proposed by the sender or receiver client. Type: _string_
es_es: Una lista separada por comas de las capacidades propuestas por el cliente emisor o receptor.

source: The name of the AMQP Client Option bean used to customize the AMQP client configuration Type: _string_
es_es: El nombre del grano de opción del cliente AMQP utilizado para personalizar la configuración del cliente AMQP Type: _string_

source: Enables (default) or disables the Cloud Event support. If enabled on an _incoming_ channel, the connector analyzes the incoming records and try to create Cloud Event metadata. If enabled on an _outgoing_, the connector sends the outgoing messages as Cloud Event if the message includes Cloud Event Metadata. Type: _boolean_
es_es: Activa (por defecto) o desactiva el soporte de Cloud Event. Si se habilita en un canal de _entrada_, el conector analiza los registros entrantes e intenta crear metadatos de Cloud Event. Si se habilita en un canal _saliente_, el conector envía los mensajes salientes como Cloud Event si el mensaje incluye metadatos Cloud Event. Type: _boolean_

source: The connection timeout in milliseconds Type: _int_
es_es: El tiempo de espera de la conexión en milisegundos Type: _int_

source: The AMQP container id Type: _string_
es_es: El id del contenedor AMQP Type: _string_

source: Whether AMQP subscription is durable Type: _boolean_
es_es: Si la suscripción AMQP es duradera Type: _boolean_

source: Specify the failure strategy to apply when a message produced from an AMQP message is nacked. Accepted values are `fail` (default), `accept`, `release`, `reject`, `modified-failed`, `modified-failed-undeliverable-here` Type: _string_
es_es: Especifica la estrategia de fallo a aplicar cuando un mensaje producido a partir de un mensaje AMQP es nacked. Los valores aceptados son `fail` (por defecto), `accept`, `release`, `reject`, `modified-failed`, `modified-failed-undeliverable-here` Type: _string_

source: The max number of seconds to wait to determine if the connection with the broker is still established for the readiness check. After that threshold, the check is considered as failed. Type: _int_
es_es: El número máximo de segundos que hay que esperar para determinar si la conexión con el corredor sigue establecida para la comprobación de disponibilidad. Después de ese umbral, la comprobación se considera fallida. Type: _int_

source: The broker hostname Type: _string_
es_es: El nombre de host del broker Type: _string_

source: The name of the link. If not set, the channel name is used. Type: _string_
es_es: El nombre del enlace. Si no se establece, se utiliza el nombre del canal. Type: _string_

source: The password used to authenticate to the broker Type: _string_
es_es: La contraseña utilizada para autenticarse en el broker Type: _string_

source: The broker port Type: _int_
es_es: El puerto del corredor Type: _int_

source: The number of reconnection attempts Type: _int_
es_es: El número de intentos de reconexión Type: _int_

source: The interval in second between two reconnection attempts Type: _int_
es_es: El intervalo en segundos entre dos intentos de reconexión Type: _int_

source: If set, explicitly override the hostname to use for the TLS SNI server name Type: _string_
es_es: Si se establece, anula explícitamente el nombre de host que se utilizará para el nombre del servidor TLS SNI Type: _string_

source: Sets a message selector. This attribute is used to define an `apache.org:selector-filter:string` filter on the source terminus, using SQL-based syntax to request the server filters which messages are delivered to the receiver (if supported by the server in question). Precise functionality supported and syntax needed can vary depending on the server. Type: _string_
es_es: Establece un selector de mensajes. Este atributo se utiliza para definir un filtro `apache.org:selector-filter:string` en la terminal de origen, utilizando sintaxis basada en SQL para solicitar al servidor que filtre qué mensajes se entregan al receptor (si el servidor en cuestión lo admite). La funcionalidad precisa soportada y la sintaxis necesaria pueden variar dependiendo del servidor.

source: Whether tracing is enabled (default) or disabled Type: _boolean_
es_es: Si el rastreo está activado (por defecto) o desactivado Type: _boolean_

source: Whether the AMQP connection uses SSL/TLS Type: _boolean_
es_es: Si la conexión AMQP utiliza SSL/TLS Type: _boolean_

source: The username used to authenticate to the broker Type: _string_
es_es: El nombre de usuario utilizado para autenticarse en el broker Type: _string_

source: If set, configure the hostname value used for the connection AMQP Open frame and TLS SNI server name (if TLS is in use) Type: _string_
es_es: Si se establece, configure el valor del nombre de host utilizado para la trama abierta AMQP de la conexión y el nombre del servidor SNI TLS (si se utiliza TLS) Type: _string_

source: Outgoing channel configuration
es_es: Configuración del canal de salida

source: Configure the default `datacontenttype` attribute of the outgoing Cloud Event. Requires `cloud-events` to be set to `true`. This value is used if the message does not configure the `datacontenttype` attribute itself Type: _string_
es_es: Configura el atributo `datacontenttype` por defecto del Evento de Nube saliente. Requiere que `cloud-events` esté configurado como `true`. Este valor se utiliza si el mensaje no configura el atributo `datacontenttype` por sí mismo Type: _string_

source: Configure the default `dataschema` attribute of the outgoing Cloud Event. Requires `cloud-events` to be set to `true`. This value is used if the message does not configure the `dataschema` attribute itself Type: _string_
es_es: Configura el atributo `dataschema` por defecto del Evento de Nube saliente. Requiere que `cloud-events` esté configurado como `true`. Este valor se utiliza si el mensaje no configura el atributo `dataschema` por sí mismo Type: _string_

source: Whether the connector should insert automatically the `time` attribute into the outgoing Cloud Event. Requires `cloud-events` to be set to `true`. This value is used if the message does not configure the `time` attribute itself Type: _boolean_
es_es: Si el conector debe o no insertar automáticamente el atributo `time` en el evento de nube saliente. Requiere que `cloud-events` se establezca en `true`. Este valor se utiliza si el mensaje no configura el atributo `time` por sí mismo Type: _boolean_

source: The Cloud Event mode (`structured` or `binary` (default)). Indicates how are written the cloud events in the outgoing record Type: _string_
es_es: El modo de eventos en la nube ( `structured` o `binary` (por defecto)). Indica cómo se escriben los eventos de la nube en el registro de salida Type: _string_

source: Configure the default `source` attribute of the outgoing Cloud Event. Requires `cloud-events` to be set to `true`. This value is used if the message does not configure the `source` attribute itself Type: _string_
es_es: Configura el atributo `source` por defecto del Evento de Nube saliente. Requiere que `cloud-events` esté configurado como `true`. Este valor se utiliza si el mensaje no configura el atributo `source` por sí mismo Type: _string_

source: Configure the default `subject` attribute of the outgoing Cloud Event. Requires `cloud-events` to be set to `true`. This value is used if the message does not configure the `subject` attribute itself Type: _string_
es_es: Configura el atributo `subject` por defecto del Evento de Nube saliente. Requiere que `cloud-events` esté configurado como `true`. Este valor se utiliza si el mensaje no configura el atributo `subject` por sí mismo Type: _string_

source: Configure the default `type` attribute of the outgoing Cloud Event. Requires `cloud-events` to be set to `true`. This value is used if the message does not configure the `type` attribute itself Type: _string_
es_es: Configura el atributo `type` por defecto del Evento de Nube saliente. Requiere que `cloud-events` esté configurado como `true`. Este valor se utiliza si el mensaje no configura el atributo `type` por sí mismo Type: _string_

source: The period (in milliseconds) between two attempts to retrieve the credits granted by the broker. This time is used when the sender run out of credits. Type: _int_
es_es: El período (en milisegundos) entre dos intentos de recuperar los créditos concedidos por el corredor. Este tiempo se utiliza cuando el emisor se queda sin créditos. Type: _int_

source: Whether sent AMQP messages are marked durable Type: _boolean_
es_es: Si los mensajes AMQP enviados se marcan como duraderos Type: _boolean_

source: Whether the connector should allow multiple upstreams Type: _boolean_
es_es: Si el conector debe permitir múltiples flujos ascendentes Type: _boolean_

source: The time-to-live of the sent AMQP messages. 0 to disable the TTL Type: _long_
es_es: El tiempo de vida de los mensajes AMQP enviados. 0 para desactivar el TTL Type: _long_

source: Whether the connector should use an anonymous sender. Default value is `true` if the broker supports it, `false` otherwise. If not supported, it is not possible to dynamically change the destination address. Type: _boolean_
es_es: Si el conector debe utilizar o no un remitente anónimo. El valor por defecto es `true` si el broker lo soporta, `false` en caso contrario. Si no se admite, no es posible cambiar dinámicamente la dirección de destino. Type: _boolean_

source: Conditionally configure channels
es_es: Configurar canales condicionalmente

source: You can configure the channels using a specific profile. Thus, the channels are only configured (and added to the application) when the specified profile is enabled.
es_es: Puede configurar los canales utilizando un perfil específico. Así, los canales sólo se configuran (y se añaden a la aplicación) cuando el perfil especificado está activado.

source: To achieve this, you need:
es_es: Para conseguirlo, necesitas:

source: Prefix the `mp.messaging.[incoming|outgoing].$channel` entries with `%my-profile` such as `%my-profile.mp.messaging.[incoming|outgoing].$channel.key=value`
es_es: Prefijo para las entradas `mp.messaging.[incoming|outgoing].$channel` con `%my-profile`, de modo que queden como `%my-profile.mp.messaging.[incoming|outgoing].$channel.key=value`

source: Use the `@IfBuildProfile("my-profile")` on the CDI beans containing `@Incoming(channel)` and `@Outgoing(channel)` annotations that need only to be enabled when the profile is enabled.
es_es: Utilice el `@IfBuildProfile("my-profile")` en los beans CDI que contienen anotaciones `@Incoming(channel)` y `@Outgoing(channel)` que sólo necesitan ser habilitadas cuando el perfil está habilitado.

source: Note that reactive messaging verifies that the graph is complete. So, when using such a conditional configuration, ensure the application works with and without the profile enabled.
es_es: Tenga en cuenta que la mensajería reactiva verifica que el grafo esté completo. Por lo tanto, cuando utilice una configuración condicional de este tipo, asegúrese de que la aplicación funciona con y sin el perfil activado.

source: Note that this approach can also be used to change the channel configuration based on a profile.
es_es: Tenga en cuenta que este enfoque también se puede utilizar para cambiar la configuración del canal en función de un perfil.
