Repository: quarkusio/es.quarkus.io
Catalog: l10n/po/*/_versions/3.15/guides/amqp-reference.adoc.po
Languages: es_es

source: Reactive Messaging AMQP 1.0 Connector Reference Documentation
es_es: Documentación de referencia del conector AMQP 1.0 de mensajería reactiva

source: This guide is the companion from the xref:amqp.adoc[Getting Started with AMQP 1.0]. It explains in more details the configuration and usage of the AMQP connector for reactive messaging.
es_es: Esta guía es la compañera de la xref:amqp.adoc[Introducción a AMQP 1.0]. Explica con más detalle la configuración y el uso del conector AMQP para mensajería reactiva.

source: This documentation does not cover all the details of the connector. Refer to the https://smallrye.io/smallrye-reactive-messaging[SmallRye Reactive Messaging website] for further details.
es_es: Esta documentación no cubre todos los detalles del conector. Consulte la link:https://smallrye.io/smallrye-reactive-messaging[página web de SmallRye Reactive Messaging] para más detalles.

source: The AMQP connector allows Quarkus applications to send and receive messages using the AMQP 1.0 protocol. More details about the protocol can be found in https://docs.oasis-open.org/amqp/core/v1.0/os/amqp-core-overview-v1.0-os.html[the AMQP 1.0 specification]. It's important to note that AMQP 1.0 and AMQP 0.9.1 (implemented by RabbitMQ) are incompatible. Check <<using-rabbitmq,Using RabbitMQ>> to get more details.
es_es: El conector AMQP permite a las aplicaciones Quarkus enviar y recibir mensajes utilizando el protocolo AMQP 1.0. Puede encontrar más detalles sobre el protocolo en link:https://docs.oasis-open.org/amqp/core/v1.0/os/amqp-core-overview-v1.0-os.html[la especificación AMQP 1.0]. Es importante tener en cuenta que AMQP 1.0 y AMQP 0.9.1 (implementado por RabbitMQ) son incompatibles. Consulte xref:using-rabbitmq[Uso de RabbitMQ] para obtener más detalles.

source: AMQP connector extension
es_es: Extensión del conector AMQP

source: To use the connector, you need to add the `quarkus-messaging-amqp` extension.
es_es: Para utilizar el conector, debe añadir la extensión `quarkus-messaging-amqp` .

source: You can add the extension to your project using:
es_es: Puede añadir la extensión a su proyecto utilizando:

source: Or just add the following dependency to your project:
es_es: O simplemente añada la siguiente dependencia a su proyecto:

source: Once added to your project, you can map _channels_ to AMQP addresses by configuring the `connector` attribute:
es_es: Una vez añadido a tu proyecto, puedes asignar _canales_ a direcciones AMQP configurando el atributo `connector`:

source: Connector auto-attachment
es_es: Conexión automática de los conectores

source: If you have a single connector on your classpath, you can omit the `connector` attribute configuration. Quarkus automatically associates _orphan_ channels to the (unique) connector found on the classpath. _Orphans_ channels are outgoing channels without a downstream consumer or incoming channels without an upstream producer.
es_es: Si tiene un único conector en su classpath, puede omitir la configuración del atributo `connector`. Quarkus asocia automáticamente los canales _huérfanos_ al conector (único) que se encuentra en el classpath. Los canales _huérfanos_ son canales salientes sin un consumidor descendente o canales entrantes sin un productor ascendente.

source: This auto-attachment can be disabled using:
es_es: Esta autoadhesión se puede desactivar mediante:

source: Configuring the AMQP Broker access
es_es: Configuración del acceso al Broker AMQP

source: The AMQP connector connects to AMQP 1.0 brokers such as Apache ActiveMQ or Artemis. To configure the location and credentials of the broker, add the following properties in the `application.properties`:
es_es: El conector AMQP conecta con brokers AMQP 1.0 como Apache ActiveMQ o Artemis. Para configurar la ubicación y las credenciales del broker, añada las siguientes propiedades en `application.properties`:

source: Configures the broker/router host name. You can do it per channel (using the `host` attribute) or globally using `amqp-host`
es_es: Configura el nombre de host del broker/router. Puedes hacerlo por canal (usando el atributo `host` ) o globalmente usando `amqp-host`

source: Configures the broker/router port. You can do it per channel (using the `port` attribute) or globally using `amqp-port`. The default is `5672`.
es_es: Configura el puerto del broker/router. Puedes hacerlo por canal (usando el atributo `port` ) o globalmente usando `amqp-port`. El valor por defecto es `5672`.

source: Configures the broker/router username if required. You can do it per channel (using the `username` attribute) or globally using `amqp-username`.
es_es: Configura el nombre de usuario del broker/router si es necesario. Puedes hacerlo por canal (usando el atributo `username` ) o globalmente usando `amqp-username`.

source: Configures the broker/router password if required. You can do it per channel (using the `password` attribute) or globally using `amqp-password`.
es_es: Configura la contraseña del broker/router si es necesario. Puedes hacerlo por canal (usando el atributo `password` ) o globalmente usando `amqp-password`.

source: Instructs the prices channel to be managed by the AMQP connector
es_es: Indica que el canal de precios debe ser gestionado por el conector AMQP

source: In dev mode and when running tests, xref:amqp-dev-services.adoc[Dev Services for AMQP] automatically starts an AMQP broker.
es_es: En el modo dev y cuando se ejecutan pruebas, xref:amqp-dev-services.html[Dev Services for AMQP] inicia automáticamente un broker AMQP.

source: Receiving AMQP messages
es_es: Recepción de mensajes AMQP

source: Let's imagine your application receives `Message<Double>`. You can consume the payload directly:
es_es: Imaginemos que su aplicación recibe `Message<Double>`. Puede consumir la carga útil directamente:

source: Or, you can retrieve the Message<Double>:
es_es: O bien, puede recuperar el Message<Double>:

source: Inbound Metadata
es_es: Metadatos de entrada

source: Messages coming from AMQP contain an instance of `IncomingAmqpMetadata` in the metadata.
es_es: Los mensajes procedentes de AMQP contienen una instancia de `IncomingAmqpMetadata` en los metadatos.

source: Deserialization
es_es: Deserialización

source: The connector converts incoming AMQP Messages into Reactive Messaging `Message<T>` instances. `T` depends on the _body_ of the received AMQP Message.
es_es: El conector convierte los Mensajes AMQP entrantes en instancias de Mensajería Reactiva `Message<T>`. `T` depende del _cuerpo_ del Mensaje AMQP recibido.

source: The https://docs.oasis-open.org/amqp/core/v1.0/os/amqp-core-types-v1.0-os.html[AMQP Type System] defines the supported types.
es_es: El link:http://docs.oasis-open.org/amqp/core/v1.0/os/amqp-core-types-v1.0-os.html[sistema de tipos AMQP] define los tipos soportados.

source: AMQP Body Type
es_es: Tipo de cuerpo AMQP

source: AMQP Value containing a https://docs.oasis-open.org/amqp/core/v1.0/os/amqp-core-types-v1.0-os.html#section-primitive-type-definitions[AMQP Primitive Type]
es_es: Valor AMQP que contiene un link:http://docs.oasis-open.org/amqp/core/v1.0/os/amqp-core-types-v1.0-os.html#section-primitive-type-definitions[tipo primitivo AMQP]

source: the corresponding Java type
es_es: el tipo Java correspondiente

source: AMQP Value using the `Binary` type
es_es: Valor AMQP utilizando el tipo `Binary`

source: AMQP Sequence
es_es: Secuencia AMQP

source: AMQP Data (with binary content) and the `content-type` is set to `application/json`
es_es: AMQP Data (con contenido binario) y el `content-type` está configurado como `application/json`

source: AMQP Data with a different `content-type`
es_es: Datos AMQP con un `content-type`

source: If you send objects with this AMQP connector (outbound connector), it gets encoded as JSON and sent as binary. The `content-type` is set to `application/json`. So, you can rebuild the object as follows:
es_es: Si envía objetos con este conector AMQP (conector de salida), se codifica como JSON y se envía como binario. El `content-type` se establece en `application/json`. Por lo tanto, puede reconstruir el objeto de la siguiente manera:

source: The `Price` instances are automatically encoded to JSON by the connector
es_es: Las instancias de `Price` son codificadas automáticamente en JSON por el conector

source: You can receive it using a `JsonObject`
es_es: Puede recibirlo mediante un `JsonObject`

source: Then, you can reconstruct the instance using the `mapTo` method
es_es: A continuación, puede reconstruir la instancia utilizando el método `mapTo`

source: The `mapTo` method uses the Quarkus Jackson mapper. Check xref:rest-json.adoc#json[this guide] to learn more about the mapper configuration.
es_es: El método `mapTo` utiliza el mapeador Quarkus Jackson. Consulta xref:rest-json.html#json[esta guía] para saber más sobre la configuración del mapeador.

source: Acknowledgement
es_es: Agradecimiento

source: When a Reactive Messaging Message associated with an AMQP Message is acknowledged, it informs the broker that the message has been https://docs.oasis-open.org/amqp/core/v1.0/os/amqp-core-messaging-v1.0-os.html#type-accepted[accepted].
es_es: Cuando un mensaje de Mensajería Reactiva asociado a un Mensaje AMQP es reconocido, informa al broker que el mensaje ha sido link:http://docs.oasis-open.org/amqp/core/v1.0/os/amqp-core-messaging-v1.0-os.html#type-accepted[aceptado].

source: Failure Management
es_es: Gestión de fallos

source: If a message produced from an AMQP message is _nacked_, a failure strategy is applied. The AMQP connector supports six strategies:
es_es: Si un mensaje producido a partir de un mensaje AMQP es _nacked_, se aplica una estrategia de fallo. El conector AMQP admite seis estrategias:

source: `fail` - fail the application; no more AMQP messages will be processed (default). The AMQP message is marked as rejected.
es_es: `fail` - falla la aplicación; no se procesarán más mensajes AMQP (por defecto). El mensaje AMQP se marca como rechazado.

source: `accept` - this strategy marks the AMQP message as _accepted_. The processing continues ignoring the failure. Refer to the https://docs.oasis-open.org/amqp/core/v1.0/os/amqp-core-messaging-v1.0-os.html#type-accepted[accepted delivery state documentation].
es_es: `accept` - esta estrategia marca el mensaje AMQP como _aceptado_. El procesamiento continúa ignorando el fallo. Consulte la link:https://docs.oasis-open.org/amqp/core/v1.0/os/amqp-core-messaging-v1.0-os.html#type-accepted[documentación sobre el estado de entrega aceptado].

source: `release` - this strategy marks the AMQP message as _released_. The processing continues with the next message. The broker can redeliver the message. Refer to the https://docs.oasis-open.org/amqp/core/v1.0/os/amqp-core-messaging-v1.0-os.html#type-released[released delivery state documentation].
es_es: `release` - esta estrategia marca el mensaje AMQP como _liberado_. El procesamiento continúa con el siguiente mensaje. El broker puede volver a entregar el mensaje. Consulte la link:https://docs.oasis-open.org/amqp/core/v1.0/os/amqp-core-messaging-v1.0-os.html#type-released[documentación sobre el estado de entrega liberado].

source: `reject` - this strategy marks the AMQP message as rejected. The processing continues with the next message. Refer to the https://docs.oasis-open.org/amqp/core/v1.0/os/amqp-core-messaging-v1.0-os.html#type-rejected[rejected delivery state documentation].
es_es: `reject` - esta estrategia marca el mensaje AMQP como rechazado. El procesamiento continúa con el siguiente mensaje. Consulte la link:https://docs.oasis-open.org/amqp/core/v1.0/os/amqp-core-messaging-v1.0-os.html#type-rejected[documentación sobre el estado de entrega rechazado].

source: `modified-failed` - this strategy marks the AMQP message as _modified_ and indicates that it failed (with the `delivery-failed` attribute). The processing continues with the next message, but the broker may attempt to redeliver the message. Refer to the https://docs.oasis-open.org/amqp/core/v1.0/os/amqp-core-messaging-v1.0-os.html#type-modified[modified delivery state documentation]
es_es: `modified-failed` - esta estrategia marca el mensaje AMQP como _modificado_ e indica que ha fallado (con el atributo `delivery-failed`). El procesamiento continúa con el siguiente mensaje, pero el broker puede intentar volver a entregar el mensaje. Consulte la link:https://docs.oasis-open.org/amqp/core/v1.0/os/amqp-core-messaging-v1.0-os.html#type-modified[documentación sobre el estado de entrega modificado]

source: `modified-failed-undeliverable-here` - this strategy marks the AMQP message as _modified_ and indicates that it failed (with the `delivery-failed` attribute). It also indicates that the application cannot process the message, meaning that the broker will not attempt to redeliver the message to this node. The processing continues with the next message. Refer to the https://docs.oasis-open.org/amqp/core/v1.0/os/amqp-core-messaging-v1.0-os.html#type-modified[modified delivery state documentation]
es_es: `modified-failed-undeliverable-here` - esta estrategia marca el mensaje AMQP como _modificado_ e indica que ha fallado (con el atributo `delivery-failed`). También indica que la aplicación no puede procesar el mensaje, lo que significa que el broker no intentará volver a entregar el mensaje a este nodo. El procesamiento continúa con el siguiente mensaje. Consulte la link:https://docs.oasis-open.org/amqp/core/v1.0/os/amqp-core-messaging-v1.0-os.html#type-modified[documentación sobre el estado de entrega modificado]

source: Sending AMQP messages
es_es: Envío de mensajes AMQP

source: Serialization
es_es: Serialización

source: When sending a `Message<T>`, the connector converts the message into an AMQP Message. The payload is converted to the AMQP Message _body_.
es_es: Al enviar un `Message<T>`, el conector convierte el mensaje en un Mensaje AMQP. La carga útil se convierte en el _cuerpo_ del Mensaje AMQP.

source: AMQP Message Body
es_es: Cuerpo del mensaje AMQP

source: primitive types or `String`
es_es: tipos primitivos o `String`

source: AMQP Value with the payload
es_es: Valor AMQP con la carga útil

source: `Instant` or `UUID`
es_es: `Instant` o `UUID`

source: AMQP Value using the corresponding AMQP Type
es_es: Valor AMQP utilizando el tipo AMQP correspondiente

source: https://vertx.io/docs/apidocs/io/vertx/core/json/JsonObject.html[`JsonObject`] or https://vertx.io/docs/apidocs/io/vertx/core/json/JsonArray.html[`JsonArray`]
es_es: https://vertx.io/docs/apidocs/io/vertx/core/json/JsonObject.html[`JsonObject`] o link:https://vertx.io/docs/apidocs/io/vertx/core/json/JsonArray.html[`JsonArray`]

source: AMQP Data using a binary content. The `content-type` is set to `application/json`
es_es: Datos AMQP utilizando un contenido binario. El `content-type` está configurado como `application/json`

source: AMQP Data using a binary content. No `content-type` set
es_es: Datos AMQP utilizando un contenido binario. No se ha establecido `content-type`

source: Any other class
es_es: Cualquier otra clase

source: The payload is converted to JSON (using a Json Mapper). The result is wrapped into AMQP Data using a **binary** content. The `content-type` is set to `application/json`
es_es: La carga útil se convierte en JSON (utilizando un mapeador Json). El resultado se envuelve en AMQP Data usando un contenido *binario*. El `content-type` se establece en `application/json`

source: If the message payload cannot be serialized to JSON, the message is _nacked_.
es_es: Si la carga útil del mensaje no puede ser serializada a JSON, el mensaje es _nacked_.

source: Outbound Metadata
es_es: Metadatos de salida

source: When sending `Messages`, you can add an instance of `OutgoingAmqpMetadata` to influence how the message is going to be sent to AMQP. For example, you can configure the subjects, properties:
es_es: Al enviar `Messages`, puede añadir una instancia de `OutgoingAmqpMetadata` para influir en cómo se va a enviar el mensaje a AMQP. Por ejemplo, puedes configurar los temas y propiedades:

source: Dynamic address names
es_es: Nombres de direcciones dinámicas

source: Sometimes it is desirable to select the destination of a message dynamically. In this case, you should not configure the address inside your application configuration file, but instead, use the outbound metadata to set the address.
es_es: A veces es conveniente seleccionar el destino de un mensaje de forma dinámica. En este caso, no debe configurar la dirección dentro del archivo de configuración de su aplicación, sino utilizar los metadatos de salida para establecer la dirección.

source: For example, you can send to a dynamic address based on the incoming message:
es_es: Por ejemplo, puede enviar a una dirección dinámica en función del mensaje entrante:

source: To be able to set the address per message, the connector is using an _anonymous sender_.
es_es: Para poder establecer la dirección por mensaje, el conector utiliza un _remitente anónimo_.

source: By default, the Reactive Messaging `Message` is acknowledged when the broker acknowledged the message. When using routers, this acknowledgement may not be enabled. In this case, configure the `auto-acknowledgement` attribute to acknowledge the message as soon as it has been sent to the router.
es_es: Por defecto, la mensajería reactiva `Message` es reconocida cuando el broker reconoce el mensaje. Cuando se utilizan enrutadores, puede que este acuse de recibo no esté habilitado. En este caso, configure el atributo `auto-acknowledgement` para que reconozca el mensaje tan pronto como se haya enviado al enrutador.

source: If an AMQP message is rejected/released/modified by the broker (or cannot be sent successfully), the message is nacked.
es_es: Si un mensaje AMQP es rechazado/liberado/modificado por el broker (o no puede ser enviado con éxito), el mensaje es nacked.

source: Back Pressure and Credits
es_es: Presión trasera y créditos

source: The back-pressure is handled by AMQP _credits_. The outbound connector only requests the amount of allowed credits. When the amount of credits reaches 0, it waits (in a non-blocking fashion) until the broker grants more credits to the AMQP sender.
es_es: La contrapresión se gestiona mediante _créditos_ AMQP. El conector de salida sólo solicita la cantidad de créditos permitidos. Cuando la cantidad de créditos llega a 0, espera (de forma no bloqueante) hasta que el broker concede más créditos al remitente AMQP.

source: Configuring the AMQP address
es_es: Configuración de la dirección AMQP

source: You can configure the AMQP address using the `address` attribute:
es_es: Puedes configurar la dirección AMQP utilizando el atributo `address`:

source: If the `address` attribute is not set, the connector uses the channel name.
es_es: Si el atributo `address` no está establecido, el conector utiliza el nombre del canal.

source: To use an existing queue, you need to configure the `address`, `container-id` and, optionally, the `link-name` attributes. For example, if you have an Apache Artemis broker configured with:
es_es: Para utilizar una cola existente, debe configurar los atributos `address`, `container-id` y, opcionalmente, `link-name`. Por ejemplo, si tiene un corredor Apache Artemis configurado con:

source: You need the following configuration:
es_es: Necesita la siguiente configuración:

source: You may need to configure the `link-name` attribute, if the queue name is not the channel name:
es_es: Es posible que tenga que configurar el atributo `link-name`, si el nombre de la cola no es el nombre del canal:

source: To use a `MULTICAST` queue, you need to provide the _FQQN_ (fully-qualified queue name) instead of just the name of the queue:
es_es: Para utilizar una cola de `MULTICAST`, es necesario proporcionar el _FQQN_ (nombre de cola totalmente calificado) en lugar de sólo el nombre de la cola:

source: More details about the AMQP Address model can be found in the https://activemq.apache.org/components/artemis/documentation/2.0.0/address-model.html[Artemis documentation].
es_es: Puede encontrar más detalles sobre el modelo de direcciones AMQP en la https://activemq.apache.org/components/artemis/documentation/2.0.0/address-model.html[documentación de Artemis].

source: Execution model and Blocking processing
es_es: Modelo de ejecución y procesamiento por bloqueo

source: Reactive Messaging invokes your method on an I/O thread. See the xref:quarkus-reactive-architecture.adoc[Quarkus Reactive Architecture documentation] for further details on this topic. But, you often need to combine Reactive Messaging with blocking processing such as database interactions. For this, you need to use the `@Blocking` annotation indicating that the processing is _blocking_ and should not be run on the caller thread.
es_es: La Mensajería Reactiva invoca su método en un hilo I/O. Consulte la xref:quarkus-reactive-architecture.adoc[documentación de la Arquitectura Reactiva de Quarkus] para más detalles sobre este tema. Pero, a menudo necesita combinar la Mensajería Reactiva con el procesamiento de bloqueo, como las interacciones con la base de datos. Para ello, necesita utilizar la anotación `@Blocking` indicando que el procesamiento es _bloqueante_ y no debe ejecutarse en el hilo de llamada.

source: For example, The following code illustrates how you can store incoming payloads to a database using Hibernate with Panache:
es_es: Por ejemplo, el siguiente código ilustra cómo puede almacenar las cargas útiles entrantes en una base de datos utilizando Hibernate con Panache:

source: There are 2 `@Blocking` annotations:
es_es: Hay 2 anotaciones en `@Blocking`:

source: They have the same effect. Thus, you can use both. The first one provides more fine-grained tuning such as the worker pool to use and whether it preserves the order. The second one, used also with other reactive features of Quarkus, uses the default worker pool and preserves the order.
es_es: Tienen el mismo efecto. Por lo tanto, puede utilizar ambos. El primero proporciona un ajuste más fino, como la reserva de trabajadores a utilizar y si preserva el orden. El segundo, utilizado también con otras características reactivas de Quarkus, utiliza el pool de trabajadores por defecto y preserva el orden.

source: For running the blocking processing on Java _virtual threads_, see the xref:messaging-virtual-threads.adoc[Quarkus Virtual Thread support with Reactive Messaging documentation].
es_es: Para ejecutar el procesamiento de bloqueo en _hilos virtuales_ Java, véase la link:messaging-virtual-threads.html[documentación sobre el soporte de hilos virtuales de Quarkus con mensajería reactiva].

source: If your method is annotated with `@Transactional`, it will be considered _blocking_ automatically, even if the method is not annotated with `@Blocking`.
es_es: Si su método está anotado con `@Transactional`, se considerará automáticamente _bloqueante_, incluso si el método no está anotado con `@Blocking`.

source: Customizing the underlying AMQP client
es_es: Personalización del cliente AMQP subyacente

source: The connector uses the Vert.x AMQP client underneath. More details about this client can be found in the https://vertx.io/docs/vertx-amqp-client/java/[Vert.x website].
es_es: El conector utiliza el cliente AMQP de Vert.x por debajo. Puede encontrar más detalles sobre este cliente en la link:https://vertx.io/docs/vertx-amqp-client/java/[página web de Vert.x].

source: You can customize the underlying client configuration by producing an instance of `AmqpClientOptions` as follows:
es_es: Puede personalizar la configuración del cliente subyacente produciendo una instancia de `AmqpClientOptions` de la siguiente manera:
