Repository: quarkusio/es.quarkus.io
Catalog: l10n/po/*/_versions/3.15/guides/vertx-reference.adoc.po
Languages: es_es

source: https://stackoverflow.com/questions/61767702/what-exactly-is-io-uring[What exactly is io_uring?]: io_uring is a Linux kernel interface to efficiently allow you to send and receive data asynchronously. It was originally designed to target block devices and files but has since gained the ability to work with things like network sockets.
es_es: link:https://stackoverflow.com/questions/61767702/what-exactly-is-io-uring[¿Qué es exactamente io_uring?]: io_uring es una interfaz del núcleo de Linux que permite enviar y recibir datos de forma asíncrona de manera eficiente. Se diseñó originalmente para dirigirse a dispositivos de bloques y archivos, pero desde entonces ha adquirido la capacidad de trabajar con elementos como los sockets de red.

source: To use `io_uring`, you need to add two dependencies to your project and enable native transport. First add the following dependencies to your project:
es_es: Para utilizar `io_uring`, necesita añadir dos dependencias a su proyecto y habilitar el transporte nativo. En primer lugar, añada las siguientes dependencias a su proyecto:

source: Then, in the `application.properties`, add:
es_es: A continuación, en el `application.properties`, añada:

source: Can I use io_uring on my Linux machine?
es_es: ¿Puedo utilizar io_uring en mi máquina Linux?

source: To check if you can use `io_uring` on your Linux machine, execute the following command:
es_es: Para comprobar si puede utilizar `io_uring` en su máquina Linux, ejecute el siguiente comando:

source: If it prints something like above, you can use `io_uring`.
es_es: Si imprime algo como lo anterior, puede utilizar `io_uring`.

source: Troubleshooting
es_es: Solución de problemas

source: `io_uring` support is still experimental. Check the https://github.com/netty/netty-incubator-transport-io_uring#faq[Netty io_uring FAQ] if you see some odd behavior. Also, the https://github.com/netty/netty-incubator-transport-io_uring/issues/152[netty io_uring was slower than epoll] issue describes a few configuration mistakes.
es_es: El soporte de `io_uring` es todavía experimental. Consulte link:https://github.com/netty/netty-incubator-transport-io_uring#faq[las preguntas frecuentes de Netty io_uring] si observa algún comportamiento extraño. Además, el problema link:https://github.com/netty/netty-incubator-transport-io_uring/issues/152[netty io_uring era más lento que epoll] describe algunos errores de configuración.

source: Domain sockets are not yet supported with io_uring.
es_es: Los sockets de dominio aún no están soportados con io_uring.

source: The Vert.x asynchronous file system API does not use io_uring yet.
es_es: La API del sistema de archivos asíncrono Vert.x aún no utiliza io_uring.

source: Deploy on read-only environments
es_es: Desplegar en entornos de solo lectura

source: In environments with read only file systems you may receive errors of the form:
es_es: En entornos con sistemas de archivos de solo lectura puede recibir errores de la forma:

source: Assuming `/tmp/` is writable this can be fixed by setting the `vertx.cacheDirBase` property to point to a directory in `/tmp/` for instance in Kubernetes by creating an environment variable `JAVA_OPTS` with the value `-Dvertx.cacheDirBase=/tmp/vertx`, or setting the `quarkus.vertx.cache-directory` property in `application.properties`:
es_es: Suponiendo que `/tmp/` sea escribible, esto puede solucionarse estableciendo la propiedad `vertx.cacheDirBase` para que apunte a un directorio en `/tmp/`, por ejemplo en Kubernetes creando una variable de entorno `JAVA_OPTS` con el valor `-Dvertx.cacheDirBase=/tmp/vertx`, o estableciendo la propiedad `quarkus.vertx.cache-directory` en `application.properties`:

source: Customize the Vert.x configuration
es_es: Personalizar la configuración de Vert.x

source: The configuration of the managed Vert.x instance can be provided using the `application.properties` file, but also using _special beans_. CDI beans exposing the `io.quarkus.vertx.VertxOptionsCustomizer` interface can be used to customize the Vert.x configuration. For example, the following customizer change the `tmp` base directory:
es_es: La configuración de la instancia Vert.x gestionada puede proporcionarse mediante el archivo `application.properties`, pero también mediante _beans especiales_. Los beans CDI que exponen la interfaz `io.quarkus.vertx.VertxOptionsCustomizer` pueden utilizarse para personalizar la configuración de Vert.x. Por ejemplo, el siguiente personalizador cambia el directorio base `tmp`:

source: The _customizer_ beans received the `VertxOptions` (coming from the application configuration), and can modify them.
es_es: Los beans _customizer_ reciben los `VertxOptions` (provenientes de la configuración de la aplicación) y pueden modificarlos.
