Repository: quarkusio/es.quarkus.io
Catalog: l10n/po/*/_versions/3.15/guides/vertx-reference.adoc.po
Languages: es_es

source: Alternatively, you can use the `blocking` attribute from the `@ConsumeEvent` annotation:
es_es: Alternativamente, puede utilizar el atributo `blocking` de la anotación `@ConsumeEvent`:

source: When using `@Blocking`, it ignores the value of the `blocking` attribute of `@ConsumeEvent`.
es_es: Cuando se utiliza `@Blocking`, se ignora el valor del atributo `blocking` de `@ConsumeEvent`.

source: Reply to events
es_es: Responder a eventos

source: The _return_ value of a method annotated with `@ConsumeEvent` is used to respond to the incoming message. For instance, in the following snippet, the returned `String` is the response.
es_es: El valor de _retorno_ de un método anotado con `@ConsumeEvent` se utiliza para responder al mensaje entrante. Por ejemplo, en el siguiente fragmento, el `String` devuelto es la respuesta.

source: You can also return a `Uni<T>` or a `CompletionStage<T>` to handle asynchronous reply:
es_es: También puede devolver un `Uni<T>` o un `CompletionStage<T>` para manejar la respuesta asíncrona:

source: You can inject an `executor` if you use the Context Propagation extension:
es_es: Puede inyectar un `executor` si utiliza la extensión de Propagación de Contexto:

source: Implement fire-and-forget interactions
es_es: Implementar interacciones de disparar y olvidar

source: You don't have to reply to received messages. Typically, for a _fire and forget_ interaction, the messages are consumed, and the sender does not need to know about it. To implement this pattern, your consumer method returns `void`.
es_es: No es necesario responder a los mensajes recibidos. Normalmente, para una interacción de _disparar y olvidar_, los mensajes se consumen y el remitente no necesita saberlo. Para implementar este patrón, su método consumidor devuelve `void`.

source: Consume messages (instead of events)
es_es: Consumir mensajes (en lugar de eventos)

source: Unlike the previous example using the _payloads_ directly, you can also use `Message` directly:
es_es: A diferencia del ejemplo anterior en el que se utilizaban directamente las _cargas útiles_, también se puede utilizar directamente `Message`:

source: Handle failures
es_es: Manejo de fallos

source: If a method annotated with `@ConsumeEvent` throws an exception, then:
es_es: Si un método anotado con `@ConsumeEvent` lanza una excepción, entonces:

source: if a reply handler is set, then the failure is propagated back to the sender via an `io.vertx.core.eventbus.ReplyException` with code `ConsumeEvent#FAILURE_CODE` and the exception message,
es_es: si se establece un manejador de respuesta, entonces el fallo se propaga de vuelta al remitente a través de un `io.vertx.core.eventbus.ReplyException` con el código `ConsumeEvent#FAILURE_CODE` y el mensaje de excepción,

source: if no reply handler is set, then the exception is rethrown (and wrapped in a `RuntimeException` if necessary) and can be handled by the default exception handler, _i.e._ `io.vertx.core.Vertx#exceptionHandler()`.
es_es: si no se establece un manejador de respuesta, la excepción se vuelve a lanzar (y se envuelve en un `RuntimeException` si es necesario) y puede ser manejada por el manejador de excepciones por defecto, es decir, `io.vertx.core.Vertx#exceptionHandler()`.

source: Send messages
es_es: Enviar mensajes

source: Sending and publishing messages use the Vert.x event bus:
es_es: El envío y la publicación de mensajes utilizan el bus de eventos Vert.x:

source: Inject the Event bus
es_es: Inyectar el bus de eventos

source: Send a message to the address `greeting`. Message payload is `name`
es_es: Envía un mensaje a la dirección `greeting`. El contenido del mensaje es `name`

source: The `EventBus` object provides methods to:
es_es: El objeto `EventBus` proporciona métodos para:

source: `send` a message to a specific address - one single consumer receives the message.
es_es: `send` un mensaje a una dirección específica: un solo consumidor recibe el mensaje.

source: `publish` a message to a specific address - all consumers receive the messages.
es_es: `publish` un mensaje a una dirección específica: todos los consumidores reciben los mensajes.

source: `request` a message and expect a reply
es_es: `request` un mensaje y esperar una respuesta

source: Process events on virtual threads
es_es: Procesar eventos en hilos virtuales

source: Methods annotated with `@ConsumeEvent` can also be annotated with `@RunOnVirtualThread`. In this case, the method is invoked on a virtual thread. Each event is invoked on a different virtual thread.
es_es: Los métodos anotados con `@ConsumeEvent` también pueden anotarse con `@RunOnVirtualThread`. En este caso, el método se invoca en un hilo virtual. Cada evento se invoca en un hilo virtual diferente.

source: To use this feature, make sure:
es_es: Para utilizar esta función, asegúrese de que:

source: Your Java runtime supports virtual threads.
es_es: El tiempo de ejecución de Java admite hilos virtuales.

source: Your method uses a blocking signature.
es_es: Su método utiliza una firma bloqueante.

source: The second point means only methods returning an object or `void` can use `@RunOnVirtualThread`. Methods returning a `Uni` or a `CompletionStage` **cannot** run on virtual threads.
es_es: El segundo punto significa que solo los métodos que devuelven un objeto o `void` pueden utilizar `@RunOnVirtualThread`. Los métodos que devuelven un `Uni` o un `CompletionStage` **no pueden** ejecutarse en hilos virtuales.

source: Read xref:./virtual-threads.adoc[the virtual thread guide] for more details.
es_es: Lea xref:./virtual-threads.adoc[la guía de hilos virtuales] para más detalles.

source: Use codecs
es_es: Uso de códecs

source: The link:++https://vertx.io/docs/vertx-core/java/#event_bus++[Vert.x Event Bus] uses link:++https://vertx.io/docs/vertx-core/java/#_message_codecs++[codecs] to _serialize_ and _deserialize_ message objects. Quarkus provides a default codec for local delivery. This codec is automatically used for return types and message body parameters of local consumers, i.e. methods annotated with `@ConsumeEvent` where `ConsumeEvent#local() == true` (which is the default).
es_es: El link:++https://vertx.io/docs/vertx-core/java/#event_bus++[Bus de Eventos Vert.x] utiliza link:++https://vertx.io/docs/vertx-core/java/#_message_codecs++[códecs] para _serializar_ y _deserializar_ objetos de mensaje. Quarkus proporciona un códec por defecto para la entrega local. Este códec se utiliza automáticamente para los tipos de retorno y los parámetros del cuerpo del mensaje de los consumidores locales, es decir, los métodos anotados con `@ConsumeEvent` donde `ConsumeEvent#local() == true` (que es el predeterminado).

source: So that you can exchange the message objects as follows:
es_es: Para que pueda intercambiar los objetos de mensaje de la siguiente manera:

source: If you want to use a specific codec, you need to set it on both ends explicitly:
es_es: Si quiere usar un códec específico, tiene que configurarlo en ambos extremos explícitamente:

source: Set the name of the codec to use to send the message
es_es: Establezca el nombre del códec que se utilizará para enviar el mensaje

source: Set the codec to use to receive the message
es_es: Establezca el códec que se utilizará para recibir el mensaje

source: Combine HTTP and the Event Bus
es_es: Combinar HTTP y el bus de eventos

source: Let's revisit a greeting HTTP endpoint and use asynchronous message passing to delegate the call to a separated bean. It uses the request/reply dispatching mechanism. Instead of implementing the business logic inside the Jakarta REST endpoint, we are sending a message. Another bean consumes this message, and the response is sent using the _reply_ mechanism.
es_es: Volvamos a un endpoint HTTP de saludo y utilicemos el paso asíncrono de mensajes para delegar la llamada a un bean separado. Utiliza el mecanismo de envío de petición/respuesta. En lugar de implementar la lógica de negocio dentro del endpoint REST de Jakarta, estamos enviando un mensaje. Otro bean consume este mensaje, y la respuesta se envía utilizando el mecanismo de _respuesta_.

source: In your HTTP endpoint class, inject the event bus and uses the `request` method to send a message to the event bus and expect a response:
es_es: En su clase de endpoint HTTP, inyecte el bus de eventos y utilice el método `request` para enviar un mensaje al bus de eventos y esperar una respuesta:

source: send the `name` to the `greeting` address and request a response
es_es: enviar el `name` a la dirección `greeting` y solicitar una respuesta

source: when we get the response, extract the body and send it to the user
es_es: cuando obtenemos la respuesta, extraer el cuerpo y enviarlo al usuario

source: the HTTP method returns a `Uni`. If you are using Quarkus REST, `Uni` support is built-in. If you are using _classic_ RESTEasy, you need to add the `quarkus resteasy-mutiny` extension to your project.
es_es: el método HTTP devuelve un `Uni`. Si está utilizando Quarkus REST, la compatibilidad con `Uni` está incorporada. Si utiliza RESTEasy _clásico_, deberá añadir la extensión `quarkus resteasy-mutiny` a su proyecto.

source: We need a consumer listening on the `greeting` address. This consumer can be in the same class or another bean such as:
es_es: Necesitamos un consumidor que escuche en la dirección `greeting`. Este consumidor puede estar en la misma clase o en otro bean como:

source: This bean receives the name and returns the greeting message.
es_es: Este bean recibe el nombre y devuelve el mensaje de saludo.

source: With this in place, every HTTP request on `/bus/quarkus` sends a message to the event bus, waits for a reply, and when this one arrives, writes the HTTP response:
es_es: Con esto en marcha, cada petición HTTP en `/bus/quarkus` envía un mensaje al bus de eventos, espera una respuesta, y cuando esta llega, escribe la respuesta HTTP:

source: To better understand, let's detail how the HTTP request/response has been handled:
es_es: Para entenderlo mejor, vamos a detallar cómo se ha gestionado la petición/respuesta HTTP:

source: The request is received by the `greeting` method
es_es: La petición es recibida por el método `greeting`

source: a message containing the _name_ is sent to the event bus
es_es: se envía un mensaje con el _name_ al bus de eventos

source: Another bean receives this message and computes the response
es_es: Otro bean recibe este mensaje y calcula la respuesta

source: This response is sent back using the reply mechanism
es_es: Esta respuesta se devuelve mediante el mecanismo de respuesta

source: Once the reply is received by the sender, the content is written to the HTTP response
es_es: Una vez que el remitente recibe la respuesta, el contenido se escribe en la respuesta HTTP

source: Bidirectional communication with browsers by using SockJS
es_es: Comunicación bidireccional con los navegadores mediante SockJS

source: The SockJS bridge provided by Vert.x allows browser applications and Quarkus applications to communicate using the event bus. It connects both sides. So, both sides can send messages received on the other side. It supports the three delivery mechanisms.
es_es: El puente SockJS proporcionado por Vert.x permite que las aplicaciones del navegador y las aplicaciones de Quarkus se comuniquen utilizando el bus de eventos. Conecta ambos lados. Así, ambos lados pueden enviar mensajes recibidos en el otro lado. Soporta los tres mecanismos de entrega.

source: SockJS negotiates the communication channel between the Quarkus application and the browser. If WebSockets are supported, it uses them; otherwise, it degrades to SSE, long polling, etc.
es_es: SockJS negocia el canal de comunicación entre la aplicación Quarkus y el navegador. Si se admiten WebSockets, los utiliza; de lo contrario, se degrada a SSE, sondeo largo, etc.

source: So use SockJS, you need to configure the bridge, especially the addresses that will be used to communicate:
es_es: Para utilizar SockJS, es necesario configurar el puente, especialmente las direcciones que se utilizarán para comunicarse:

source: This code configures the SockJS bridge to send all the messages targeting the `ticks` address to the connected browsers. More detailed explanations about the configuration can be found on https://vertx.io/docs/vertx-web/java/#_sockjs_event_bus_bridge[the Vert.x SockJS Bridge documentation].
es_es: Este código configura el puente SockJS para que envíe todos los mensajes dirigidos a la dirección `ticks` a los navegadores conectados. Encontrará explicaciones más detalladas sobre la configuración en link:https://vertx.io/docs/vertx-web/java/#_sockjs_event_bus_bridge[la documentación del puente SockJS de Vert.x].

source: The browser must use the `vertx-eventbus` JavaScript library to consume the message:
es_es: El navegador debe utilizar la biblioteca JavaScript `vertx-eventbus` para consumir el mensaje:

source: Use native transports
es_es: Uso de transportes nativos

source: Native transports are not supported in native executables.
es_es: Los transportes nativos no están soportados en los ejecutables nativos.

source: To use `io_uring`, refer to the <<use-io_uring>> section.
es_es: Para utilizar `io_uring`, consulte la sección <<use-io_uring>>.

source: Vert.x is capable of using https://netty.io/wiki/native-transports.html[Netty's native transports], which offers performance improvements on specific platforms. To enable them, you must include the appropriate dependency for your platform. It's usually a good idea to have both to keep your application platform-agnostic. Netty is smart enough to use the correct one, that includes none at all on unsupported platforms:
es_es: Vert.x es capaz de utilizar link:https://netty.io/wiki/native-transports.html[los transportes nativos de Netty], que ofrecen mejoras de rendimiento en plataformas específicas. Para habilitarlos, debe incluir la dependencia adecuada para su plataforma. Suele ser una buena idea tener ambas para mantener su aplicación agnóstica a la plataforma. Netty es lo suficientemente inteligente como para utilizar la correcta, es decir, ninguna en absoluto en plataformas no soportadas:

source: You will also have to explicitly configure Vert.x to use the native transport. In `application.properties` add:
es_es: También tendrá que configurar explícitamente Vert.x para que utilice el transporte nativo. En `application.properties` añada:

source: Or in `application.yml`:
es_es: O en `application.yml`:

source: If all is well quarkus will log:
es_es: Si todo va bien, Quarkus registrará:

source: [io.qua.ver.cor.run.VertxCoreRecorder] (main) Vertx has Native Transport Enabled: true
es_es: [io.qua.ver.cor.run.VertxCoreRecorder] (main) Vertx tiene habilitado el transporte nativo: true

source: Native Linux transport
es_es: Transporte nativo de Linux

source: On Linux you can enable the following socket options:
es_es: En Linux puede activar las siguientes opciones de socket:

source: Native macOS transport
es_es: Transporte nativo de macOS

source: On macOS Sierra and above you can enable the following socket options:
es_es: En macOS Sierra y superior puede habilitar las siguientes opciones de socket:

source: Use a Vert.x context-aware scheduler
es_es: Uso de un programador Vert.x sensible al contexto

source: The default executor is returned by `io.smallrye.mutiny.infrastructure.Infrastructure` and it is already configured and managed by Quarkus.
es_es: El ejecutor por defecto es devuelto por `io.smallrye.mutiny.infrastructure.Infrastructure` y ya está configurado y gestionado por Quarkus.

source: That being said, there are cases where you need to make sure that an operation is run on a Vert.x (duplicated) context and not just on any random thread.
es_es: Dicho esto, hay casos en los que es necesario asegurarse de que una operación se ejecuta en un contexto Vert.x (duplicado) y no en un hilo cualquiera.

source: The `io.smallrye.mutiny.vertx.core.ContextAwareScheduler` interface offers an API to obtain context-aware schedulers. Such a scheduler is configured with:
es_es: La interfaz `io.smallrye.mutiny.vertx.core.ContextAwareScheduler` ofrece una API para obtener programadores conscientes del contexto. Un programador de este tipo se configura con:

source: a delegate `ScheduledExecutorService` of your choice (hint: you can reuse `Infrastructure.getDefaultWorkerPool()`), and
es_es: un delegado `ScheduledExecutorService` de su elección (pista: puede reutilizar `Infrastructure.getDefaultWorkerPool()`), y

source: a context fetching strategy among:
es_es: una estrategia de obtención de contexto entre:

source: an explicit `Context`, or
es_es: un `Context` explícito, o

source: calling `Vertx::getOrCreateContext()` either on the current thread or later when the scheduling request happens, or
es_es: llamar a `Vertx::getOrCreateContext()`, ya sea en el hilo actual o más tarde, cuando se produzca la solicitud de programación, o

source: calling `Vertx::currentContext()`, which fails if the current thread is not a Vert.x thread.
es_es: llamar a `Vertx::currentContext()`, que falla si el hilo actual no es un hilo Vert.x.

source: Here is a sample where `ContextAwareScheduler` is used:
es_es: He aquí un ejemplo en el que se utiliza `ContextAwareScheduler`:

source: In this example a scheduler is created by capturing the context of the Vert.x event-loop that calls `asyncStart()`. The `delayIt` operator uses that scheduler, and we can check that the context that we get in `invoke` is a Vert.x duplicated context where the data for key `"foo"` has been propagated.
es_es: En este ejemplo se crea un programador capturando el contexto del bucle de eventos Vert.x que llama a `asyncStart()`. El operador `delayIt` utiliza ese programador, y podemos comprobar que el contexto que obtenemos en `invoke` es un contexto duplicado Vert.x en el que se han propagado los datos de la clave `"foo"`.

source: Use a Unix domain socket
es_es: Uso de un socket de dominio Unix

source: Listening on a Unix domain socket allows us to dispense with the overhead of TCP if the connection to the quarkus service is established from the same host. This can happen if access to the service goes through a proxy which is often the case if you're setting up a service mesh with a proxy like Envoy.
es_es: Escuchar en un socket de dominio Unix nos permite prescindir de la sobrecarga de TCP si la conexión al servicio Quarkus se establece desde el mismo host. Esto puede ocurrir si el acceso al servicio se realiza a través de un proxy, lo que suele ser el caso si está configurando una malla de servicios con un proxy como Envoy.

source: This will only work on platforms that support <<native-transport>>.
es_es: Esto solo funcionará en plataformas que admitan <<native-transport>>.

source: Enable the appropriate <<native-transport>> and set the following environment property:
es_es: Habilite el <<native-transport>> correspondiente y establezca la siguiente propiedad de entorno:

source: By itself this will not disable the tcp socket which by default will open on `0.0.0.0:8080`. It can be explicitly disabled:
es_es: Por sí mismo esto no desactivará el socket TCP que por defecto se abrirá en `0.0.0.0:8080`. Puede desactivarse explícitamente:

source: These properties can be set through Java's `-D` command line parameter or on `application.properties`.
es_es: Estas propiedades pueden establecerse a través del parámetro de línea de comandos `-D` de Java o en `application.properties`.

source: Do not forget to add the native transport dependency. See <<native-transport>> for details.
es_es: No olvide añadir la dependencia de transporte nativo. Consulte <<native-transport>> para más detalles.

source: Make sure your application has the right permissions to write to the socket.
es_es: Asegúrese de que su aplicación tiene los permisos adecuados para escribir en el socket.

source: Use io_uring
es_es: Uso de io_uring

source: `io_uring` is not supported in native executables.
es_es: `io_uring` no está soportado en los ejecutables nativos.

source: `io_uring` support is experimental
es_es: El soporte de `io_uring` es experimental

source: `io_uring` is a Linux kernel interface that allows you to send and receive data asynchronously. It provides unified semantics for both file and network I/O. It was originally designed to target block devices and files but has since gained the ability to work with things like network sockets. It has the potential to provide modest performance benefits to network I/O on its own and greater benefits for mixed file and network I/O application workloads.
es_es: `io_uring` es una interfaz del núcleo de Linux que permite enviar y recibir datos de forma asíncrona. Proporciona una semántica unificada tanto para la E/S de archivos como de red. Se diseñó originalmente para dirigirse a dispositivos de bloques y archivos, pero desde entonces ha adquirido la capacidad de trabajar con elementos como los sockets de red. Tiene el potencial de proporcionar modestos beneficios de rendimiento a la E/S de red por sí sola y mayores beneficios para cargas de trabajo de aplicaciones mixtas de E/S de archivo y de red.

source: To learn more about `io_uring`, we recommend the following links:
es_es: Para saber más sobre `io_uring`, le recomendamos los siguientes enlaces:

source: https://developers.redhat.com/articles/2023/04/12/why-you-should-use-iouring-network-io[Why you should use io_uring for network I/O]: The main benefit of io_uring for network I/O is a modern asynchronous API that is straightforward to use and provides unified semantics for file and network I/O. A potential performance benefit of io_uring for network I/O is reducing the number of syscalls. This could provide the biggest benefit for high volumes of small operations where the overhead of system calls can be significant.
es_es: link:https://developers.redhat.com/articles/2023/04/12/why-you-should-use-iouring-network-io[Por qué debería utilizar io_uring para la E/S de red]: El principal beneficio de io_uring para la E/S de red es una API asíncrona moderna que es fácil de usar y proporciona una semántica unificada para la E/S de archivos y de red. Un beneficio potencial de rendimiento de io_uring para la E/S de red es la reducción del número de syscalls. Esto podría proporcionar el mayor beneficio para grandes volúmenes de pequeñas operaciones en las que la sobrecarga de las llamadas al sistema puede ser significativa.

source: https://dzone.com/articles/the-backend-revolution-or-why-io-uring-is-so-impor[The Backend Revolution and Why io_uring Is So Important]: The io_uring API uses two ring buffers for communication between application and kernel (hence the API name) and designed in a way that enables natural batching of requests and responses. Besides, it provides a way to submit multiple requests in one system call, which can reduce overhead.
es_es: link:https://dzone.com/articles/the-backend-revolution-or-why-io-uring-is-so-impor[La revolución del backend y por qué io_uring es tan importante]: La API io_uring utiliza dos búferes de anillo para la comunicación entre la aplicación y el núcleo (de ahí el nombre de la API) y está diseñada de tal forma que permite el procesamiento natural por lotes de las peticiones y las respuestas. Además, proporciona una forma de enviar múltiples peticiones en una sola llamada al sistema, lo que puede reducir la sobrecarga.
