Repository: quarkusio/es.quarkus.io
Catalog: l10n/po/*/_versions/3.15/guides/vertx-reference.adoc.po
Languages: es_es

source: Vert.x Reference Guide
es_es: Guía de referencia Vert.x

source: https://vertx.io[Vert.x] is a toolkit for building reactive applications. As described in the xref:quarkus-reactive-architecture.adoc[Quarkus Reactive Architecture], Quarkus uses Vert.x underneath.
es_es: link:https://vertx.io[Vert.x] es un conjunto de herramientas para construir aplicaciones reactivas. Como se describe en la xref:quarkus-reactive-architecture.adoc[Arquitectura Reactiva de Quarkus], Quarkus utiliza Vert.x por debajo.

source: This guide is the companion to the xref:vertx.adoc[Using Eclipse Vert.x API from a Quarkus Application] guide. It provides more advanced details about the usage and the configuration of the Vert.x instance used by Quarkus.
es_es: Esta guía es el complemento de la guía xref:vertx.adoc[Uso de la API Vert.x de Eclipse desde una aplicación Quarkus]. Proporciona detalles más avanzados sobre el uso y la configuración de la instancia Vert.x utilizada por Quarkus.

source: Access the Vert.x instance
es_es: Acceso a la instancia Vert.x

source: To access the managed Vert.x instance, add the `quarkus-vertx` extension to your project. This dependency might already be available in your project (as a transitive dependency).
es_es: Para acceder a la instancia gestionada de Vert.x, añada la extensión `quarkus-vertx` a su proyecto. Es posible que esta dependencia ya esté disponible en su proyecto (como dependencia transitiva).

source: With this extension, you can retrieve the managed instance of Vert.x using either field or constructor injection:
es_es: Con esta extensión, puede recuperar la instancia gestionada de Vert.x utilizando la inyección por campo o constructor:

source: You can inject either the:
es_es: Puede inyectar:

source: `io.vertx.core.Vertx` instance exposing the _bare_ Vert.x API
es_es: la instancia `io.vertx.core.Vertx` que expone la API Vert.x _bare_

source: `io.vertx.mutiny.core.Vertx` instance exposing the _Mutiny_ API
es_es: la instancia `io.vertx.mutiny.core.Vertx` que expone la API _Mutiny_

source: We recommend using the Mutiny variant as it integrates with the other reactive APIs provided by Quarkus.
es_es: Recomendamos utilizar la variante Mutiny, ya que se integra con las demás APIs reactivas proporcionadas por Quarkus.

source: If you are not familiar with Mutiny, check xref:mutiny-primer.adoc[Mutiny - an intuitive reactive programming library].
es_es: Si no está familiarizado con Mutiny, consulte xref:mutiny-primer.adoc[Mutiny - una biblioteca de programación reactiva intuitiva].

source: Documentation about the Vert.x Mutiny variant is available on https://smallrye.io/smallrye-mutiny-vertx-bindings.
es_es: La documentación sobre la variante Vert.x Mutiny está disponible en link:https://smallrye.io/smallrye-mutiny-vertx-bindings[smallrye.io].

source: Configure the Vert.x instance
es_es: Configurar la instancia Vert.x

source: You can configure the Vert.x instance from the `application.properties` file. The following table lists the supported properties:
es_es: Puede configurar la instancia Vert.x desde el archivo `application.properties`. La siguiente tabla enumera las propiedades admitidas:

source: <span class="icon"><i class="fa fa-lock" title="Fixed at build time"></i></span> Configuration property fixed at build time - All other configuration properties are overridable at runtime <input type="search" id="config-search-0" placeholder="FILTER CONFIGURATION" disabled>
es_es: <span class="icon"><i class="fa fa-lock" title="Fijado en tiempo de compilación"></i></span> Propiedad de configuración fijada en tiempo de compilación - Todas las demás propiedades de configuración son anulables en tiempo de ejecución <input type="search" id="config-search-0" placeholder="CONFIGURACIÓN DEL FILTRO" disabled>

source: See <<customizing-the-vert-x-configuration>> to configure the Vert.x instance using a programmatic approach.
es_es: Consulte <<customizing-the-vert-x-configuration>> para configurar la instancia Vert.x mediante un enfoque programático.

source: Use Vert.x clients
es_es: Uso de clientes Vert.x

source: In addition to Vert.x core, you can use most Vert.x ecosystem libraries. Some Quarkus extension already wraps Vert.x libraries.
es_es: Además del núcleo Vert.x, puede utilizar la mayoría de las bibliotecas del ecosistema Vert.x. Algunas extensiones de Quarkus ya envuelven bibliotecas Vert.x.

source: Available APIs
es_es: APIs disponibles

source: The following table lists the **most** used libraries from the Vert.x ecosystem. To access these APIs, add the indicated extension or dependency to your project. Check the associated documentation to learn how to use them.
es_es: La siguiente tabla enumera las bibliotecas **más** utilizadas del ecosistema Vert.x. Para acceder a estas APIs, añada la extensión o dependencia indicada a su proyecto. Consulte la documentación asociada para aprender a utilizarlas.

source: Extension or Dependency
es_es: Extensión o dependencia

source: Documentation
es_es: Documentación

source: AMQP Client
es_es: Cliente AMQP

source: `io.quarkus:quarkus-messaging-amqp` (extension)
es_es: `io.quarkus:quarkus-messaging-amqp` (extensión)

source: xref:amqp.adoc[Getting Started to Quarkus Messaging with AMQP]
es_es: xref:amqp.adoc[Introducción a la mensajería Quarkus con AMQP]

source: Circuit Breaker
es_es: Interruptor automático

source: `io.smallrye.reactive:smallrye-mutiny-vertx-circuit-breaker` (external dependency)
es_es: `io.smallrye.reactive:smallrye-mutiny-vertx-circuit-breaker` (dependencia externa)

source: https://vertx.io/docs/vertx-circuit-breaker/java/
es_es: link:https://vertx.io/docs/vertx-circuit-breaker/java/[vertx.io]

source: Consul Client
es_es: Cliente Consul

source: `io.smallrye.reactive:smallrye-mutiny-vertx-consul-client` (external dependency)
es_es: `io.smallrye.reactive:smallrye-mutiny-vertx-consul-client` (dependencia externa)

source: https://vertx.io/docs/vertx-consul-client/java/
es_es: link:https://vertx.io/docs/vertx-consul-client/java/[vertx.io]

source: DB2 Client
es_es: Cliente DB2

source: `io.quarkus:quarkus-reactive-db2-client` (extension)
es_es: `io.quarkus:quarkus-reactive-db2-client` (extensión)

source: xref:reactive-sql-clients.adoc[Reactive SQL Clients]
es_es: xref:reactive-sql-clients.adoc[Clientes SQL Reactivos]

source: Kafka Client
es_es: Cliente Kafka

source: `io.quarkus:quarkus-messaging-kafka` (extension)
es_es: `io.quarkus:quarkus-messaging-kafka` (extensión)

source: xref:kafka.adoc[Apache Kafka Reference Guide]
es_es: xref:kafka.adoc[Guía de referencia de Apache Kafka]

source: Mail Client
es_es: Cliente de correo

source: `io.quarkus:quarkus-mailer` (extension)
es_es: `io.quarkus:quarkus-mailer` (extensión)

source: xref:mailer.adoc[Sending emails using SMTP]
es_es: xref:mailer.adoc[Envío de correos electrónicos mediante SMTP]

source: MQTT Client
es_es: Cliente MQTT

source: `io.quarkus:quarkus-messaging-mqtt` (extension)
es_es: `io.quarkus:quarkus-messaging-mqtt` (extensión)

source: No guide yet
es_es: Todavía no hay guía

source: MS SQL Client
es_es: Cliente MS SQL

source: `io.quarkus:quarkus-reactive-mssql-client` (extension)
es_es: `io.quarkus:quarkus-reactive-mssql-client` (extensión)

source: MySQL Client
es_es: Cliente MySQL

source: `io.quarkus:quarkus-reactive-mysql-client` (extension)
es_es: `io.quarkus:quarkus-reactive-mysql-client` (extensión)

source: Oracle Client
es_es: Cliente Oracle

source: `io.quarkus:quarkus-reactive-oracle-client` (extension)
es_es: `io.quarkus:quarkus-reactive-oracle-client` (extensión)

source: PostgreSQL Client
es_es: Cliente PostgreSQL

source: `io.quarkus:quarkus-reactive-pg-client` (extension)
es_es: `io.quarkus:quarkus-reactive-pg-client` (extensión)

source: RabbitMQ Client
es_es: Cliente RabbitMQ

source: `io.smallrye.reactive:smallrye-mutiny-vertx-rabbitmq-client` (external dependency)
es_es: `io.smallrye.reactive:smallrye-mutiny-vertx-rabbitmq-client` (dependencia externa)

source: https://vertx.io/docs/vertx-rabbitmq-client/java
es_es: link:https://vertx.io/docs/vertx-rabbitmq-client/java[vertx.io]

source: Redis Client
es_es: Cliente Redis

source: `io.quarkus:quarkus-redis-client` (extension)
es_es: `io.quarkus:quarkus-redis-client` (extensión)

source: xref:redis.adoc[Using the Redis Client]
es_es: xref:redis.adoc[Uso del cliente Redis]

source: Web Client
es_es: Cliente web

source: `io.smallrye.reactive:smallrye-mutiny-vertx-web-client` (external dependency)
es_es: `io.smallrye.reactive:smallrye-mutiny-vertx-web-client` (dependencia externa)

source: https://vertx.io/docs/vertx-web-client/java/
es_es: link:https://vertx.io/docs/vertx-web-client/java/[vertx.io]

source: To learn more about the usage of the Vert.x Mutiny API, refer to https://smallrye.io/smallrye-mutiny-vertx-bindings.
es_es: Para saber más sobre el uso de la API de Vert.x Mutiny, consulte link:https://smallrye.io/smallrye-mutiny-vertx-bindings[smallrye.io].

source: Use the Vert.x Web Client
es_es: Uso del cliente web Vert.x

source: This section gives an example using the Vert.x `WebClient` in the context of a Quarkus REST (formerly RESTEasy Reactive) application. As indicated in the table above, add the following dependency to your project:
es_es: Esta sección ofrece un ejemplo de utilización del `WebClient` de Vert.x en el contexto de una aplicación REST de Quarkus (anteriormente RESTEasy Reactive). Como se indica en la tabla anterior, añada la siguiente dependencia a su proyecto:

source: Now, in your code, you can create an instance of `WebClient`:
es_es: Ahora, en su código, puede crear una instancia de `WebClient`:

source: This resource creates a `WebClient` and, upon request, uses this client to invoke a remote HTTP API. Depending on the result, the response is forwarded as received, or it creates a JSON object wrapping the error. The `WebClient` is asynchronous (and non-blocking), to the endpoint returns a `Uni`.
es_es: Este recurso crea un `WebClient` y, al recibir una petición, utiliza este cliente para invocar una API HTTP remota. Dependiendo del resultado, la respuesta se reenvía tal y como se recibió, o crea un objeto JSON que envuelve el error. El `WebClient` es asíncrono (y no bloqueante), por lo que el endpoint devuelve un `Uni`.

source: The application can also run as a native executable. But, first, we need to instruct Quarkus to enable _ssl_ (if the remote API uses HTTPS). Open the `src/main/resources/application.properties` and add:
es_es: La aplicación también puede ejecutarse como un ejecutable nativo. Pero, primero, necesitamos instruir a Quarkus para que habilite _ssl_ (si la API remota utiliza HTTPS). Abra el `src/main/resources/application.properties` y añada:

source: Then, create the native executable with:
es_es: Luego, cree el ejecutable nativo con:

source: Use Vert.x JSON
es_es: Uso de Vert.x JSON

source: Vert.x APIs often rely on JSON. Vert.x provides two convenient classes to manipulate JSON document: `io.vertx.core.json.JsonObject` and `io.vertx.core.json.JsonArray`.
es_es: Las APIs de Vert.x dependen a menudo de JSON. Vert.x proporciona dos clases convenientes para manipular documentos JSON: `io.vertx.core.json.JsonObject` y `io.vertx.core.json.JsonArray`.

source: `JsonObject` can be used to map an object into its JSON representation and build an object from a JSON document:
es_es: `JsonObject` se puede utilizar para mapear un objeto en su representación JSON y construir un objeto a partir de un documento JSON:

source: Note that these features use the mapper managed by the `quarkus-jackson` extension. Refer to xref:rest-json.adoc#json[Jackson configuration] to customize the mapping.
es_es: Tenga en cuenta que estas funciones utilizan el mapeador gestionado por la extensión `quarkus-jackson`. Consulte xref:rest-json.adoc#json[configuración de Jackson] para personalizar el mapeo.

source: JSON Object and JSON Array are both supported as Quarkus HTTP endpoint requests and response bodies (using classic RESTEasy and Quarkus REST). Consider these endpoints:
es_es: Tanto el objeto JSON como la matriz JSON se admiten como peticiones de endpoint HTTP de Quarkus y cuerpos de respuesta (utilizando RESTEasy clásico y REST de Quarkus). Considere estos endpoints:

source: http://localhost:8080/hello/Quarkus/object returns:
es_es: http://localhost:8080/hello/Quarkus/object devuelve:

source: http://localhost:8080/hello/Quarkus/array returns:
es_es: http://localhost:8080/hello/Quarkus/array devuelve:

source: This works equally well when the JSON content is a request body or is wrapped in a `Uni`, `Multi`, `CompletionStage` or `Publisher`.
es_es: Esto funciona igualmente bien cuando el contenido JSON es un cuerpo de petición o está envuelto en un `Uni`, `Multi`, `CompletionStage` o `Publisher`.

source: Use Verticles
es_es: Uso de vértices

source: link:https://vertx.io/docs/vertx-core/java/#_verticles[Verticles] is "a simple, scalable, actor-like deployment and concurrency model" provided by _Vert.x_. This model does not claim to be a strict actor-model implementation, but it shares similarities, especially concerning concurrency, scaling, and deployment. To use this model, you write and _deploy_ verticles, communicating by sending messages on the event bus.
es_es: link:https://vertx.io/docs/vertx-core/java/#_verticles[Verticles] es "un modelo de despliegue y concurrencia simple, escalable y similar a un actor" proporcionado por _Vert.x_. Este modelo no pretende ser una implementación estricta del modelo actor, pero comparte similitudes, especialmente en lo que respecta a la concurrencia, el escalado y el despliegue. Para utilizar este modelo, usted escribe y _despliega_ vértices, que se comunican mediante el envío de mensajes en el bus de eventos.

source: You can deploy _verticles_ in Quarkus. It supports:
es_es: Puede desplegar _vértices_ en Quarkus. Es compatible con:

source: _bare_ verticle - Java classes extending `io.vertx.core.AbstractVerticle`
es_es: vértice _bare_ - clases Java que extienden `io.vertx.core.AbstractVerticle`

source: _Mutiny_ verticle - Java classes extending `io.smallrye.mutiny.vertx.core.AbstractVerticle`
es_es: vértice _Mutiny_ - clases Java que extienden `io.smallrye.mutiny.vertx.core.AbstractVerticle`

source: Deploy Verticles
es_es: Desplegar vértices

source: To deploy verticles, use the `deployVerticle` method:
es_es: Para desplegar vértices, utilice el método `deployVerticle`:

source: If you use the Mutiny-variant of Vert.x, be aware that the `deployVerticle` method returns a `Uni`, and you would need to trigger a subscription to make the actual deployment.
es_es: Si utiliza la variante Mutiny de Vert.x, tenga en cuenta que el método `deployVerticle` devuelve un `Uni`, y tendría que activar una suscripción para realizar el despliegue real.

source: An example explaining how to deploy verticles during the initialization of the application will follow.
es_es: A continuación, un ejemplo que explica cómo desplegar vértices durante la inicialización de la aplicación.

source: Use @ApplicationScoped beans as Verticle
es_es: Uso de beans @ApplicationScoped como vértice

source: In general, Vert.x verticles are not CDI beans. And so cannot use injection. However, in Quarkus, you can deploy verticles as beans. Note that in this case, CDI (Arc in Quarkus) is responsible for creating the instance.
es_es: En general, los vértices Vert.x no son beans CDI. Por lo tanto, no pueden utilizar la inyección. Sin embargo, en Quarkus, puede desplegar vértices como beans. Tenga en cuenta que, en este caso, CDI (Arc en Quarkus) se encarga de crear la instancia.

source: The following snippet provides an example:
es_es: El siguiente fragmento ofrece un ejemplo:

source: You don't have to inject the `vertx` instance; instead, leverage the protected field from `AbstractVerticle`.
es_es: No tiene que inyectar la instancia `vertx`; en su lugar, aproveche el campo protegido de `AbstractVerticle`.

source: Then, deploy the verticle instances with:
es_es: Luego, despliegue las instancias de vértice con:

source: If you want to deploy every exposed `AbstractVerticle`, you can use:
es_es: Si quiere desplegar cada `AbstractVerticle` expuesto, puede utilizar:

source: Create multiple verticles instances
es_es: Crear múltiples instancias de vértices

source: When using `@ApplicationScoped`, you will get a single instance for your verticle. Having multiple instances of verticles can be helpful to share the load among them. Each of them will be associated with a different I/O thread (Vert.x event loop).
es_es: Cuando utilice `@ApplicationScoped`, obtendrá una única instancia para su vértice. Tener varias instancias de vértices puede ser útil para repartir la carga entre ellas. Cada una de ellas estará asociada a un hilo de E/S diferente (bucle de eventos Vert.x).

source: To deploy multiple instances of your verticle, use the `@Dependent` scope instead of `@ApplicationScoped`:
es_es: Para desplegar varias instancias de su vértice, utilice el ámbito `@Dependent` en lugar de `@ApplicationScoped`:

source: Then, deploy your verticle as follows:
es_es: A continuación, despliegue su vértice de la siguiente manera:

source: The `init` method receives an `Instance<MyVerticle>`. Then, you pass a supplier to the `deployVerticle` method. The supplier is just calling the `get()` method. Thanks to the `@Dependent` scope, it returns a new instance on every call. Finally, you pass the desired number of instances to the `DeploymentOptions`, such as two in the previous example. It will call the supplier twice, which will create two instances of your verticle.
es_es: El método `init` recibe un `Instance<MyVerticle>`. A continuación, pasa un proveedor al método `deployVerticle`. El proveedor no hace más que llamar al método `get()`. Gracias al ámbito `@Dependent`, devuelve una nueva instancia en cada llamada. Por último, pasa el número deseado de instancias a `DeploymentOptions`, como dos en el ejemplo anterior. Llamará al proveedor dos veces, lo que creará dos instancias de su vértice.

source: Use the Event Bus
es_es: Uso del bus de eventos

source: Vert.x comes with a built-in https://vertx.io/docs/vertx-core/java/#event_bus[event bus] that you can use from your Quarkus application. So, your application components (CDI beans, resources...) can interact using asynchronous events, thus promoting loose-coupling.
es_es: Vert.x viene con un link:https://vertx.io/docs/vertx-core/java/#event_bus[bus de eventos] incorporado que puede utilizar desde su aplicación Quarkus. De este modo, los componentes de su aplicación (beans CDI, recursos...) pueden interactuar utilizando eventos asíncronos, promoviendo así el acoplamiento débil.

source: With the event bus, you send _messages_ to _virtual addresses_. The event bus offers three types of delivery mechanisms:
es_es: Con el bus de eventos, usted envía _mensajes_ a _direcciones virtuales_. El bus de eventos ofrece tres tipos de mecanismos de entrega:

source: point-to-point - send the message, one consumer receives it. If several consumers listen to the address, a round-robin is applied;
es_es: punto a punto - se envía el mensaje, un consumidor lo recibe. Si varios consumidores escuchan la dirección, se aplica un round-robin;

source: publish/subscribe - publish a message; all the consumers listening to the address are receiving the message;
es_es: publicar/suscribir - publicar un mensaje; todos los consumidores que escuchan la dirección reciben el mensaje;

source: request/reply - send the message and expect a response. The receiver can respond to the message in an asynchronous fashion.
es_es: petición/respuesta - se envía el mensaje y se espera una respuesta. El receptor puede responder al mensaje de forma asíncrona.

source: All these delivery mechanisms are non-blocking and are providing one of the fundamental bricks to build reactive applications.
es_es: Todos estos mecanismos de entrega son no bloqueantes y proporcionan uno de los elementos fundamentales para construir aplicaciones reactivas.

source: Consume events
es_es: Consumir eventos

source: While you can use the Vert.x API to register consumers, Quarkus comes with declarative support. To consume events, use the `io.quarkus.vertx.ConsumeEvent` annotation:
es_es: Aunque puede utilizar la API de Vert.x para registrar consumidores, Quarkus viene con soporte declarativo. Para consumir eventos, utilice la anotación `io.quarkus.vertx.ConsumeEvent`:

source: If not set, the address is the fully qualified name of the bean; for instance, in this snippet, it's `org.acme.vertx.GreetingService`.
es_es: Si no se establece, la dirección es el nombre completo del bean; por ejemplo, en este fragmento, es `org.acme.vertx.GreetingService`.

source: The method parameter is the message body. If the method returns _something_, it's the message response.
es_es: El parámetro del método es el cuerpo del mensaje. Si el método devuelve _algo_, es la respuesta del mensaje.

source: Configure the address
es_es: Configurar la dirección

source: The `@ConsumeEvent` annotation can be configured to set the address:
es_es: La anotación `@ConsumeEvent` se puede configurar para establecer la dirección:

source: Receive the messages sent to the `greeting` address
es_es: Recibir los mensajes enviados a la dirección `greeting`

source: The address value can be a property expression. In this case, the configured value is used instead: `@ConsumeEvent("${my.consumer.address}")`. Additionally, the property expression can specify a default value: `@ConsumeEvent("${my.consumer.address:defaultAddress}")`.
es_es: El valor de la dirección puede ser una expresión de propiedad. En este caso, se utiliza el valor configurado en su lugar: `@ConsumeEvent("${my.consumer.address}")`. Además, la expresión de propiedad puede especificar un valor por defecto: `@ConsumeEvent("${my.consumer.address:defaultAddress}")`.

source: Config Property Example
es_es: Ejemplo de propiedad de configuración

source: Receive the messages sent to the address configured with the `my.consumer.address` key.
es_es: Recibir los mensajes enviados a la dirección configurada con la clave `my.consumer.address`.

source: If no config property with the specified key exists and no default value is set then the application startup fails.
es_es: Si no existe ninguna propiedad de configuración con la clave especificada y no se establece ningún valor por defecto, el inicio de la aplicación falla.

source: Process events asynchronously
es_es: Procesar eventos de forma asíncrona

source: The previous examples use synchronous processing. Asynchronous processing is also possible by returning either an `io.smallrye.mutiny.Uni` or a `java.util.concurrent.CompletionStage`:
es_es: Los ejemplos anteriores utilizan el procesamiento síncrono. El procesamiento asíncrono también es posible devolviendo un `io.smallrye.mutiny.Uni` o un `java.util.concurrent.CompletionStage`:

source: The previous example uses Mutiny reactive types. If you are not familiar with Mutiny, check xref:mutiny-primer.adoc[Mutiny - an intuitive reactive programming library].
es_es: El ejemplo anterior utiliza tipos reactivos Mutiny. Si no está familiarizado con Mutiny, consulte xref:mutiny-primer.adoc[Mutiny - una biblioteca de programación reactiva intuitiva].

source: Blocking processing of events
es_es: Procesamiento bloqueante de eventos

source: By default, the code consuming the event must be _non-blocking_, as it's called on an I/O thread. If your processing is blocking, use the `@io.smallrye.common.annotation.Blocking` annotation:
es_es: Por defecto, el código que consume el evento debe ser _no bloqueante_, ya que se llama en un hilo de E/S. Si su procesamiento es bloqueante, utilice la anotación `@io.smallrye.common.annotation.Blocking`:
